{
  "version": 1,

  "highlights": [
    {
      "id": "market_trends",
      "title": "Market Trends",
      "slides": [
        {
          "id": 1,
          "title": "Global Market Rally",
          "blocks": [
            {
              "type": "TEXT",
              "text": "Global markets rallied strongly amid easing inflation concerns.A global market rally is a widespread and rapid surge in the prices of stocks and other financial assets across international markets, typically driven by a significant influx of investor capital and optimism. These rallies can be sparked by various macroeconomic factors, such as expectations of interest rate cuts by major central banks like the U.S. Federal Reserve, positive developments in trade relations (e.g., a \"tariff ceasefire\" between major economies), robust corporate earnings reports, or technological breakthroughs like the artificial intelligence (AI) boom. For example, recent rallies have seen markets from the U.S. to Europe and Asia reach new highs, often in anticipation that monetary easing will support economic growth without triggering high inflation. \nHowever, rallies also come with inherent risks and volatility. Analysts often caution that such periods of rapid ascent can lead to stretched valuations, where asset prices rise too quickly without sufficient fundamental economic support. Geopolitical tensions, sticky core inflation, or a sudden shift in central bank policy can quickly reverse the positive momentum, sometimes resulting in a \"sucker rally\" or \"bull trap\" that misleads unsuspecting investors into losses. Therefore, while the current global rally presents opportunities for substantial returns, many experts advise caution, diversification across asset classes, and a focus on long-term fundamentals rather than short-term exuberance to navigate the dynamic and often unpredictable market conditions effectively. \n"

            },
            {
              "type": "IMAGE",
              "images": ["market_rally_1", "market_rally_2"]
            }
          ]
        },
        {
          "id": 2,
          "title": "Sector Rotation",
          "blocks": [
            {
              "type": "MARKDOWN",
              "markdown": "### Sector Rotation\nCapital is shifting from IT to banking and FMCG.\n A global market rally is a widespread and rapid surge in the prices of stocks and other financial assets across international markets, typically driven by a significant influx of investor capital and optimism. These rallies can be sparked by various macroeconomic factors, such as expectations of interest rate cuts by major central banks like the U.S. Federal Reserve, positive developments in trade relations (e.g., a \"tariff ceasefire\" between major economies), robust corporate earnings reports, or technological breakthroughs like the artificial intelligence (AI) boom. For example, recent rallies have seen markets from the U.S. to Europe and Asia reach new highs, often in anticipation that monetary easing will support economic growth without triggering high inflation. \nHowever, rallies also come with inherent risks and volatility. Analysts often caution that such periods of rapid ascent can lead to stretched valuations, where asset prices rise too quickly without sufficient fundamental economic support. Geopolitical tensions, sticky core inflation, or a sudden shift in central bank policy can quickly reverse the positive momentum, sometimes resulting in a \"sucker rally\" or \"bull trap\" that misleads unsuspecting investors into losses. Therefore, while the current global rally presents opportunities for substantial returns, many experts advise caution, diversification across asset classes, and a focus on long-term fundamentals rather than short-term exuberance to navigate the dynamic and often unpredictable market conditions effectively. \n"
            }
          ]
        }
      ]
    },

    {
      "id": "top_gainers",
      "title": "Top Gainers",
      "slides": [
        {
          "id": 1,
          "title": "Stock ABC",
          "blocks": [
            {
              "type": "TEXT",
              "text": "Stock ABC gained 8% today due to strong quarterly results."
            }
          ]
        },
        {
          "id": 2,
          "title": "Stock XYZ",
          "blocks": [
            {
              "type": "TEXT",
              "text": "Stock XYZ surged after a major institutional buy."
            }
          ]
        }
      ]
    },

    {
      "id": "latest_news",
      "title": "Latest News",
      "slides": [
        {
          "id": 1,
          "title": "RBI Policy Update",
          "blocks": [
            {
              "type": "TEXT",
              "text": "RBI kept repo rate unchanged citing inflation risks."
            }
          ]
        }
      ]
    }
  ],

  "modules": [
    {
      "id": 1,
      "title": "Basics",
      "image": "stockmarkets",
      "topCard": {
        "title": "Basics",
        "description": "Build strong foundations in stock markets. This will help in learning IPO, stock market, trading terminologies and commonly used terms of stock market and investmnet for wealth."
      },
      "levels": [
        {
          "id": 1,
          "name": "HUSTLER",
          "image": "hustler",
          "topCard": {
            "title": "HUSTLER",
            "description": "Start here if you are completely new to the stock market. This will help you in developing beasic understanding and creating foundation of you investment journey."
          },
          "chapters": [
            {
              "id": 1,
              "title": "Why we need to invest ?",
              "description": "This is first chapter which deals with why we need to invest. and will learn about more investment opportunities available.",
              "image": "stock",
              "slides": [
                {
                  "id": 1,
                  "title": "Why anyone invests ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Before addressing the investment question, let's consider the consequences of not investing. Imagine earning ₹50,000 per month, with ₹30,000 spent on daily living expenses such as housing, food, transport, shopping, medical care, etc. The remaining ₹20,000 is your monthly savings.\nFor simplicity, let's disregard the impact of taxes in this discussion.\nTo illustrate the point, consider a few basic assumptions:\nYour employer provides a 10% salary increase each year.\nThe cost of living is expected to rise by 8% annually.\nYou are 30 years old and plan to retire at 50, resulting in 20 working years.\nThere is no intention of working after retirement.\nExpenses are fixed, with no anticipated additional costs.\nThe monthly surplus of ₹20,000 is kept as physical cash."
                    }
                  ]
                },
                {
                  "id": 2,
                  "title": "Math behind every income",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Going by the assumptions in the previous card, here is what the cash balance will look like in 20 years.\nIf one were to analyze these numbers, one would soon realize this is a scary situation.\nA few things are quite obvious\nAfter 20 years of hard work, you have accumulated Rs.1.7Crs.\nSince your expenses are fixed, your lifestyle has not changed over the years, and you probably even suppressed your lifelong aspirations a better home, car, vacations, etc.\nAfter you retire, assuming the expenses will continue to grow at 8%, the retirement corpus of Rs.1.7Crs is good enough to sail you through roughly...\nExplanation of Content\nThe image content discusses the importance of investing by presenting a hypothetical financial scenario over 20 years.\nScenario: A person works for 20 years, maintaining fixed expenses and suppressing aspirations to save money.\nResult: After two decades, the total savings accumulated is Rs. 1.7 Crores.\nAnalysis: The text describes this outcome as a \"scary situation\" because this corpus is only sufficient for a limited time after retirement, assuming an 8% annual growth in expenses.\nCore Message: The passage implies that simply saving with fixed expenses is insufficient for a comfortable or sustainable retirement, highlighting the need for effective investment strategies."
                    }
                  ]
                },
                {
                  "id": 3,
                  "title": "Financial investments",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "At this stage, you might feel that the assumptions used here are too simple and that real life does not function this way. That thought is fair. However, the key takeaway from the calculation above is that when no investments are made, the cash that is saved does not grow and remains almost flat over time.\n\nNow let us look at a different situation. Instead of keeping the surplus money idle, assume you decide to invest it in an option that grows at around 12% per year. For instance, in the first year you manage to save ₹2,40,000. If this amount is invested at a 12% annual return and allowed to grow for nearly 20 years (assuming the investment is made at the end of the first year), it can grow to about ₹20,67,000 by the end of the twentieth year.\n\nFor those curious about how this growth is calculated, it follows a simple compounding formula:\n\n₹2,40,000 × (1 + 12%)¹⁹\n\nFinal value ≈ ₹20,67,000\n\nThere is no need to focus on the mathematics right now. The detailed explanation of this calculation will be covered later in this module and in other learning sections as well.\n\nBelow is a representation of how your yearly savings can grow over time when surplus cash is invested consistently.\n\nWhen surplus income is invested, the final cash balance increases significantly. In this scenario, the total amount grows to approximately ₹4.26 crore, compared to about ₹1.7 crore when no investments are made. This means the invested amount grows to nearly 2.4 times the value achieved without investing.\n\nClearly, choosing to invest places you in a much stronger financial position, especially when planning for life after retirement.\n\nComing back to the original question — why should one invest?\nThere are a few strong reasons:\n\nBeat Inflation\nInvesting helps protect money against inflation, which is the continuous rise in the cost of living over time.\n\nBuild Wealth\nThrough investing, it is possible to create a larger financial corpus by the end of a chosen time period. This goal could be retirement, children’s education, buying a house, marriage expenses, travel, or any other long-term objective."
                    }
                  ]
                },
                {
                  "id": 4,
                  "title": "Where we should invest ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Having understood the reasons for investing, the next natural question is — where should one invest, and what kind of returns can be expected? While investing, it is important to select an asset category that matches an individual’s comfort with risk and expected returns. For example, some people are willing to take higher risks with their money, while others prefer moderate risk, and some may choose options with minimal or no risk.\n\nAn asset class can be thought of as a type of investment option that is categorized based on its risk level and potential returns. Below are some commonly used asset classes:\n\nFixed income instruments\n\nEquity\n\nReal estate\n\nCommodities (such as precious metals)"
                    }
                  ]
                },
                {
                  "id": 5,
                  "title": "Fixed Income Tools",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Fixed-income instruments are investment options where the invested amount (principal) is generally considered secure. In these instruments, the investor lends money to an entity, which in return pays a fixed interest on the invested amount. One of the most common examples of a fixed-income instrument is a bank’s fixed deposit.\n\nThe interest earned on such investments can be paid at regular intervals such as quarterly, half-yearly, or yearly. Once the investment tenure is completed, the original invested amount is returned to the investor. This duration is commonly referred to as the maturity period.\n\nSome common examples of fixed-income instruments include:\n\nBank fixed deposits\n\nBonds issued by the Government of India (also known as government securities and treasury bills)\n\nBonds issued by government-backed organizations such as GAIL, HUDCO, NHAI, and similar agencies\n\nBonds issued by private companies (for example, Tata, Bajaj, Reliance, Adani)\n\nTypically, returns from fixed-income instruments vary depending on the level of risk involved. Bank fixed deposits usually offer moderate returns, government bonds provide slightly higher returns with high safety, and certain corporate bonds may offer higher returns due to increased risk. Among these, government bonds are generally viewed as the safest option because they carry minimal default risk."
                    }
                  ]
                },
                {
                  "id": 6,
                  "title": "Equity",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Investing in equity means purchasing shares of companies that are publicly listed. These shares are bought and sold on stock exchanges such as the Bombay Stock Exchange (BSE) and the National Stock Exchange (NSE).\n\nUnlike fixed-income investments, equity investments do not offer any guarantee on the invested capital. However, this higher level of risk comes with the potential for significantly better returns. Historically, Indian equity markets have delivered average returns of around 12% CAGR (compound annual growth rate) over the last 10 to 15 years.\n\nIn fact, investments made in some of the strongest and well-managed Indian companies have generated returns of more than 20% CAGR over the long term. Finding such high-quality investment opportunities requires proper analysis, consistent effort, and long-term patience."
                    }
                  ]
                },
                {
                  "id": 7,
                  "title": "What is Real Estate ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Real estate investing involves the purchase and sale of both commercial and residential properties. Common examples include buying vacant land, residential apartments, and commercial spaces such as offices or shops.\n\nIncome from real estate investments generally comes from two sources: rental earnings and the increase in property value over time. Rental returns are usually in the range of 2–3%, which may not be very attractive. Property price appreciation tends to occur only in specific locations and is not consistent across all areas.\n\nReal estate transactions can be fairly complicated, as they require legal checks and verification of documents. Additionally, investing in real estate typically demands a large amount of capital. There is also no standard or widely accepted measure to accurately calculate returns from real estate investments, making it difficult to assess performance objectively."
                    }
                  ]
                },
                {
                  "id": 8,
                  "title": "What is commodity ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Gold and silver are among the most widely preferred investment choices. Over long periods, both metals have shown steady value appreciation. Historically, investments in gold and silver have delivered an average return of around 5–8% CAGR over the past two decades.\n Note: But in recent years it given more thant 100% return in a year\n\nThere are multiple ways to invest in these precious metals. Investors may choose to buy physical forms such as jewelry, or opt for financial instruments like Exchange Traded Funds (ETFs) and Sovereign Gold Bonds, commonly known as SGBs."
                    }
                  ]
                },
                {
                  "id": 9,
                  "title": "How to allocate our Assets ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Returning to the earlier example of investing surplus money, it is useful to see how the final savings change over a 20-year period when the entire amount is invested in just one asset category — fixed income, equity, or bullion.\n\nIf the surplus is invested in fixed-income instruments at an average return of 9% per year (such as quality corporate bonds), the total corpus would grow to around ₹3.3 crore.\n\nIf the same amount is invested entirely in equities at an average return of 15% per year, the corpus would increase to approximately ₹5.4 crore.\n\nInvesting the amount in bullion at an average return of 8% per year would result in a corpus of about ₹3.09 crore.\n\nAmong these options, equities generally provide the highest returns, especially when investments are made with a long-term perspective.\n\nSome readers may question why cryptocurrencies are not included as an asset class here. When investing hard-earned money, it is important to have strong regulations, checks, and safeguards in place to protect investors. At present, cryptocurrencies lack a clear regulatory framework, and therefore it may be prudent to avoid them until proper regulations are established.\n\nIdeally, investments should not be concentrated in a single asset class. A balanced mix across different asset categories helps reduce risk and improve stability. Distributing money across various asset classes is known as asset allocation, a concept that will be discussed in detail later.\n\nFor example, a young working professional can afford to take higher risks due to a longer investment horizon. Such an investor may allocate around 60% of investable funds to equity, 20% to precious metals, and 20% to fixed-income instruments. This allocation gradually changes with age and risk tolerance. A retired individual, for instance, may prefer to invest a larger portion — possibly 80% — in safer fixed-income options such as government bonds."
                    }
                  ]
                },
                {
                  "id": 10,
                  "title": "What things to keep in mind before investing ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Investing plays a key role in financial planning. However, before beginning your investment journey, it is important to keep the following points in mind:\n\nRisk and return are closely linked.\nHigher potential returns usually come with higher risk, while lower risk investments generally offer lower returns.\n\nFixed-income investments focus on capital protection.\nThese options are comparatively safer and aim to protect the invested amount. However, after adjusting for inflation, real returns may turn negative. For example, if an investment gives a return of 9% while inflation is at 10%, the actual purchasing power reduces by about 1% annually. The risk level increases further when investing in corporate fixed-income instruments.\n\nEquity investments are effective for long-term growth.\nOver extended periods, equities have shown the ability to outperform inflation. Historically, equity markets have delivered average returns in the range of 14–15%. That said, equity investments carry higher volatility and risk.\n\nReal estate requires large capital and lacks liquidity.\nProperty investments usually need a substantial upfront amount and cannot be made with small sums. Additionally, real estate is not very liquid, meaning it may not be easy to buy or sell property whenever needed.\n\nGold and silver are relatively stable investments.\nPrecious metals are generally considered safer options, but their long-term returns are usually lower compared to equities. They are better suited for stability and diversification rather than high growth."
                    }
                  ]
                },
                {
                  "id": 11,
                  "title": "Why anyone invests in GOLD ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Investment in gold and silver (bullion) is widely regarded as one of the safest forms of investment. This belief is common across countries and cultures around the world.\n\nOver long periods, gold and silver have shown consistent appreciation in value. Historically, investments in these precious metals have delivered average returns of around 7–8% over the past two decades.\n\nThere are multiple ways to invest in gold and silver. Investors may choose physical forms such as jewellery, or opt for financial options like Exchange Traded Funds (ETFs) or government-issued gold bonds."
                    }
                  ]
                }
              ]
            },
            {
              "id": 2,
              "title": "Financial Intermediaries and Regulatory bodies",
              "description": "Learn this chapter to know market ecosystem, role of regulatory bodies and financial intermediaries and how they work ?",
              "image": "stock",
              "slides": [
                {
                  "id": 1,
                  "title": "What we mean from Stock Market ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "In the previous chapter, we learned that investing in equities is essential for achieving returns that can outpace inflation. The next question is how one actually invests in equities. Before going deeper into this topic, it is important to understand the overall market system and the different participants that make the capital market function smoothly.\n\nJust as we visit a nearby kirana store or a supermarket to buy daily essentials, we approach the stock market to carry out investment transactions. The stock market is the place where people come to buy and sell shares. In this context, a transaction simply means the purchase or sale of company shares. The main role of the stock market is to enable these transactions by bringing buyers and sellers together. If you wish to buy shares of a company, the stock market helps connect you with someone who wants to sell them, and vice versa.\n\nUnlike a physical marketplace, the stock market does not exist as a brick-and-mortar location. It operates entirely in electronic form. Investors access the stock market digitally through computers or mobile devices to place buy or sell orders. It is also important to note that individuals cannot access the stock market directly; transactions are carried out through registered intermediaries known as stockbrokers. Stockbrokers will be discussed in more detail later.\n\nIn India, there are two main stock exchanges — the Bombay Stock Exchange (BSE) and the National Stock Exchange (NSE). Although several regional stock exchanges existed earlier, most of them have either merged with BSE or NSE or have ceased operations. Therefore, when we refer to the Indian stock market today, we are primarily referring to either the NSE or the BSE."
                    }
                  ]
                },
                {
                  "id": 2,
                  "title": "Intermediate participants and their requirement to regulate",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "The stock market includes individuals and organizations from a wide range of backgrounds. Anyone who buys or sells securities in the stock market is known as a market participant. These participants can be broadly grouped into the following categories:\n\nDomestic retail participants – Individual investors like you and me who trade in the stock markets.\n\nNRIs and OCIs – People of Indian origin who reside outside India but participate in Indian markets.\n\nDomestic institutions – Indian-based corporate entities that invest or trade in the markets.\n\nDomestic Asset Management Companies (AMCs) – Mutual fund houses operating in India, such as SBI Mutual Fund, HDFC AMC, Edelweiss, ICICI Prudential, and others.\n\nForeign Institutional Investors (FIIs) – Non-Indian institutional entities, which may include foreign asset management firms, hedge funds, and other overseas investors.\n\nRegardless of the category, the common objective for all market participants is to carry out profitable transactions — simply put, to make money.\n\nHowever, when money is involved, emotions like greed and fear tend to influence decision-making. This makes it necessary to have proper rules, oversight, and regulation to ensure fair practices and protect the interests of all participants in the market."
                    }
                  ]
                },
                {
                  "id": 3,
                  "title": "The regulatory authorities",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "In India, the stock market is regulated by the Securities and Exchange Board of India (SEBI). SEBI’s role is to support the growth of stock markets, safeguard the interests of retail investors, and supervise the activities of market participants and financial intermediaries. Broadly, SEBI ensures the following:\n\nStock exchanges operate in a fair and transparent manner\n\nStockbrokers conduct their business honestly\n\nMarket participants do not engage in unfair or unethical practices\n\nCompanies do not misuse the markets for personal or undue benefit\n\nThe interests of small and retail investors are protected\n\nLarge investors with significant capital do not manipulate the markets\n\nOverall development and stability of the financial markets\n\nGiven these responsibilities, it is essential for SEBI to regulate all entities that are involved in the stock market ecosystem. Any wrongdoing by these entities can disturb the smooth and fair functioning of the Indian markets.\n\nTo ensure proper conduct, SEBI has laid down specific rules and regulations for each type of market participant. All entities are required to operate within the legal framework defined by SEBI. Detailed regulations applicable to each entity are published by SEBI on its official website under the “Legal Framework” section."
                    }
                  ]
                },
                {
                  "id": 4,
                  "title": "The Intermediators",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Many corporate entities work together to make sure that transactions in the stock market are carried out smoothly. From the moment you place a trade on a trading platform (for example, to buy shares) until those shares are credited to your DEMAT account, several intermediaries coordinate behind the scenes to ensure the entire process happens without any disruption.\n\nThese entities perform their functions quietly in the background, strictly following the rules and guidelines set by SEBI. Their role is to ensure that your experience in the stock market remains simple, efficient, and hassle-free. Such entities are commonly known as financial intermediaries or market intermediaries.\n\nCollectively, these financial intermediaries depend on one another and form an ecosystem through which the financial markets function. Let us now briefly look at some of the key market intermediaries and understand the roles they play within this ecosystem."
                    }
                  ]
                },
                {
                  "id": 5,
                  "title": "Brokers",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "A stockbroker is one of the most important financial intermediaries you should be familiar with. A stockbroker is a corporate organization that is registered as a trading member with a stock exchange and holds a valid stockbroking license. This license is issued by SEBI after proper verification, and the broker is required to follow all rules and regulations laid down by SEBI.\n\nA stockbroker acts as your entry point to the stock markets, enabling you to invest in shares, bonds, ETFs, and mutual funds. To trade in the stock market, you must first open an account with a broker of your choice. There are many brokers registered in India, and investors usually select one based on personal preferences. Some common factors people consider while choosing a broker include:\n\nEase of use and simplicity of the broker’s trading platform\n\nQuality and responsiveness of customer support\n\nAvailability of useful reports such as Profit & Loss statements, trade history, and tax reports\n\nFinancial strength of the broker (it is better to avoid brokers with weak financials)\n\nValue-added initiatives such as investor education and learning resources\n\nOnce you choose a broker and open a trading and DEMAT account, you can begin participating in the stock market. After your account is active, there are a few standard ways through which you can place trades using your broker:\n\nPlacing orders via phone – You can contact your broker, verify your identity using your client or account code, and request the dealer to place a trade on your behalf. The dealer executes the order and confirms the transaction status during the call.\n\nSelf-directed trading – This is the most commonly used method today. The broker provides access to a digital trading platform or trading terminal. After logging in, you can view live market prices and place buy or sell orders on your own. For example, Zerodha’s trading platform is known as Kite.\n\nProgrammatic trading via APIs – Experienced users can connect to the market using APIs provided by certain brokers. These services are usually offered for an additional fee and are suitable for advanced or automated trading strategies.\n\nThe key services typically offered by a stockbroker include:\n\nProviding access to the stock markets and enabling trade execution\n\nOffering margin facilities for trading (this will be discussed later)\n\nCustomer support through calls, emails, or chat to resolve issues and provide guidance\n\nIssuing contract notes for all trades — a contract note is an official record of the transactions carried out during the day\n\nEnabling fund transfers between your trading account and linked bank account\n\nProviding access to a back-office system, which is a portal containing detailed reports and account information (for example, Zerodha’s back-office platform is called Console)."
                    }
                  ]
                },
                {
                  "id": 6,
                  "title": "Depositories",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "When you purchase a property, ownership is proved by showing valid property documents. This makes it important to keep those documents safe and secure.\n\nIn a similar way, when you buy shares (which represent partial ownership in a company), ownership was earlier established through a share certificate. A share certificate is simply a document that confirms your ownership in a company. Until 1996, share certificates existed only in physical form. After that, they were converted into electronic form. This process of converting physical share certificates into digital form is known as dematerialization, commonly called DEMAT.\n\nThe move to digital shareholding gained momentum after major market events highlighted the need for a safer and more transparent system. Digitization helped improve efficiency, reduce fraud, and simplify share ownership.\n\nOnce shares are converted into DEMAT form, they must be stored electronically. This digital storage is known as a DEMAT account. A depository is a financial intermediary that provides DEMAT account services. You can think of a DEMAT account as a secure digital locker where your shares are stored. Your trading account with the broker and your DEMAT account with the depository are linked to each other.\n\nFor example, if you want to buy shares of a company like Infosys, you simply place a buy order through your trading account. Once the transaction is completed, the shares are automatically credited to your DEMAT account.\n\nSimilarly, when you decide to sell shares, you place a sell order using your trading account. While the selling action happens through the trading platform, the linked DEMAT account is debited in the background for the shares that are sold.\n\nCurrently, there are only two depositories in India that provide DEMAT account services: National Securities Depository Limited (NSDL) and Central Depository Services (India) Limited (CDSL). There is very little difference between the two, and both operate under strict regulations prescribed by SEBI."
                    }
                  ]
                },
                {
                  "id": 7,
                  "title": "Participants of Depository",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "You cannot directly visit the National Stock Exchange (NSE) to open a trading account. In the same way, you cannot approach a depository such as NSDL or CDSL directly to open a DEMAT account. To open a DEMAT account, you need to contact a Depository Participant (DP).\n\nA Depository Participant helps you create and manage your DEMAT account with a depository. The DP acts as a link between you and the depository, handling all account-related activities on your behalf. Just like other market entities, Depository Participants are also regulated and governed by the rules and guidelines set by SEBI.\n\nFor example, Zerodha acts as a Depository Participant for Central Depository Services (India) Limited (CDSL)."
                    }
                  ]
                },
                {
                  "id": 8,
                  "title": "Role of banks in stock market",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Banks play a simple but essential role in the market ecosystem. Their primary function is to enable the transfer of funds between your bank account and your trading account. Once your bank details are verified, the broker links your bank account with your trading account to allow smooth fund movement.\n\nYou are allowed to link more than one bank account to your trading account. These linked accounts can be used to add funds and place trades. However, regardless of how many bank accounts are connected, withdrawals can be made only to one designated bank account. This account is known as the primary bank account.\n\nFor instance, with platforms like Zerodha, you can link one primary bank account and up to two additional secondary bank accounts. Funds can be deposited from any of the linked accounts, but withdrawals are processed only to the primary bank account.\n\nIn addition, payouts such as dividends and proceeds from share buybacks are credited directly to the primary bank account. This primary account is connected not only to your trading account but also to the depository, registrar, and transfer agents (RTA).\n\nBy now, it should be clear that key financial intermediaries operate through separate accounts — a bank account, a trading account, and a DEMAT account — all working together to ensure smooth functioning of stock market transactions."
                    }
                  ]
                },
                {
                  "id": 9,
                  "title": "Clearing Corporations",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "NSE Clearing Limited and Indian Clearing Corporation Limited (ICCL) are fully owned subsidiaries of the National Stock Exchange and the Bombay Stock Exchange respectively.\n\nThe primary responsibility of a clearing corporation is to ensure that all trades and transactions are settled without fail. For example, if you buy one share of a company at a certain price, there must be a corresponding seller willing to sell that share at the same price. In such a transaction, the buyer’s trading account is debited for the amount, and the seller is credited with the same amount. The clearing corporation oversees this entire process to make sure it is completed correctly.\n\nIn a typical transaction, the clearing corporation ensures the following:\n\nIt identifies the buyer and the seller and properly matches the debit and credit obligations.\n\nIt guarantees that there are no defaults by either party. Once a trade is executed, the seller cannot withdraw from the transaction, and the buyer must fulfill the payment obligation. This prevents any party from backing out after the trade is confirmed.\n\nFor most investors and traders, there is no need to understand the internal workings of NSE Clearing Limited or ICCL in detail. This is because market participants do not interact with the clearing corporation directly. Its role is to function silently in the background, ensuring that every trade in the market is completed smoothly and reliably."
                    }
                  ]
                },
                {
                  "id": 10,
                  "title": "Some More Players",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Hidden Players of the Stock Market (Beyond Banks, Brokers & Regulators)\n\nWhen people think about the stock market, they usually imagine retail investors trading through brokers, with regulators like SEBI overseeing everything and depositories like CDSL or NSDL holding shares. This is only the visible surface. In reality, the stock market is a complex ecosystem where many players operate behind the scenes. These players may not place trades the way retail investors do, but they strongly influence price movement, liquidity, volatility, and long-term trends.\n\nUnderstanding these hidden participants helps explain why markets behave irrationally at times and why prices often move even when there is no obvious news.\n\nMarket Makers and Liquidity Providers\n\nMarket makers and liquidity providers ensure that there is always a buyer or seller available in the market. They continuously quote buy and sell prices and earn through spreads rather than directional bets.\n\nKey points:\n\nThey reduce sudden price gaps and extreme volatility.\n\nThey make it possible for retail traders to enter and exit positions easily.\n\nThey benefit from seeing aggregated order flow, which gives them structural advantages.\n\nWithout them, markets would become illiquid and chaotic, especially during volatile periods.\n\nCustodians and Clearing Institutions\n\nCustodians and clearing banks handle the actual settlement of trades. While brokers execute orders, these institutions ensure that shares and money are exchanged correctly between parties.\n\nTheir role includes:\n\nHolding securities on behalf of institutions.\n\nManaging settlement, dividends, bonuses, and corporate actions.\n\nReducing counterparty risk.\n\nRetail investors rarely hear about them, but if these entities fail or delay settlement, the entire market can freeze.\n\nMutual Funds and Active Fund Managers\n\nMutual funds pool money from thousands or millions of investors and deploy it through professional fund managers. Their trades are large enough to influence prices and valuations.\n\nImportant aspects:\n\nThey create sustained buying or selling pressure.\n\nTheir entry often legitimizes a stock or sector.\n\nTheir exits can trigger panic among retail investors.\n\nThey do not just follow trends; in many cases, they define them.\n\nPassive Funds, Index Funds, and ETFs\n\nPassive funds do not analyze stocks individually. They simply replicate indices. Despite this simplicity, they control enormous amounts of capital.\n\nWhy they matter:\n\nTheir buying and selling is automatic and rule-based.\n\nStocks included in indices receive consistent inflows.\n\nWhen markets fall, these funds sell mechanically, increasing volatility.\n\nThey move markets not through intelligence, but through scale.\n\nProprietary Trading Firms\n\nProprietary trading firms trade using their own capital rather than client money. They focus on short-term opportunities, arbitrage, and derivatives.\n\nCharacteristics:\n\nExtremely fast execution.\n\nHeavy use of data and models.\n\nDominant presence in intraday and futures trading.\n\nRetail traders often mistake their activity for “smart money,” but they are operating on a completely different battlefield.\n\nHigh-Frequency Trading (HFT) Systems\n\nHFTs are algorithmic systems designed to exploit speed advantages. They place and cancel thousands of orders within milliseconds.\n\nTheir influence includes:\n\nCreating the illusion of liquidity.\n\nIncreasing short-term volatility.\n\nAmplifying crashes when they suddenly withdraw from the market.\n\nIn times of stress, these systems often shut down, leaving markets exposed.\n\nForeign Institutional Investors (FIIs / FPIs)\n\nForeign investors move capital across countries based on global conditions rather than local fundamentals.\n\nThey are influenced by:\n\nInterest rates in developed economies.\n\nCurrency movements.\n\nGeopolitical risks and global liquidity.\n\nA single month of foreign selling can overpower years of retail inflows, making them one of the strongest market-moving forces.\n\nCredit Rating Agencies\n\nCredit rating agencies evaluate the creditworthiness of companies and financial instruments. Their opinions affect institutional participation.\n\nWhy they matter:\n\nDowngrades can trigger sharp sell-offs.\n\nMany institutions are restricted from investing below certain ratings.\n\nTheir actions influence perception more than fundamentals.\n\nMarkets often react more strongly to ratings than to actual balance sheet changes.\n\nResearch Analysts, Media, and Market Narratives\n\nFinancial media, brokerage research, and market commentators shape how information is perceived.\n\nTheir role:\n\nFraming narratives around results, budgets, and policies.\n\nInfluencing retail sentiment and expectations.\n\nAmplifying fear or optimism.\n\nMarkets move on expectations, and these players largely control those expectations.\n\nCorporate Promoters and Insiders\n\nPromoters and senior management are closest to the real condition of a company.\n\nTheir influence comes from:\n\nTiming of fund-raising, buybacks, and dividends.\n\nStrategic disclosures.\n\nCapital allocation decisions.\n\nEven when acting legally, their decisions often precede visible market movements.\n\nAuditors and Professional Consultants\n\nAuditors, valuation experts, and consultants validate the financial information that markets rely on.\n\nTheir importance lies in:\n\nEstablishing trust in reported numbers.\n\nPreventing misinformation from spreading.\n\nMaintaining confidence in corporate disclosures.\n\nWhen this trust breaks, stock prices can collapse instantly.\n\nTechnology and Infrastructure Providers\n\nStock markets depend heavily on technology providers who build and maintain trading, risk, and data systems.\n\nThey control:\n\nMarket uptime and stability.\n\nData accuracy and speed.\n\nSystemic risk management.\n\nA technical failure can halt trading and shake investor confidence within minutes.\n\nThe Bigger Reality\n\nThe stock market is not driven purely by supply and demand between buyers and sellers. It is shaped by a layered structure of influence where capital size, speed, information access, and narrative control matter more than individual intelligence.\n\nRetail investors are participants, but not controllers.\n\nUnderstanding these hidden players does not guarantee profits, but it provides something far more valuable:\nclarity about why markets behave the way they do and protection from emotional decision-making."
                    }
                  ]
                }
              ]
            },
            {
              "id": 3,
              "title": "The way to IPO",
              "description": "Read this to understand why companies file for IPO and and how there shares lists in primary market to trade exchange. ",
              "image": "stock",
              "slides": [
                {
                  "id": 1,
                  "title": "How a business founded ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "The first few chapters helped build a foundation around the basic concepts of financial markets. At this point, it becomes important to address a key question — why do companies decide to go public? Understanding this topic clearly is essential, as it forms the base for many concepts that will be discussed later.\n\nIn this chapter and the one that follows, we will explore the reasons behind companies going public. Along the way, we will also get introduced to a few important financial ideas related to this process.\n\nBefore directly answering why companies choose to go public, let us first understand a basic concept — how a typical business begins and evolves. We will use a simple, familiar storyline to explain this. By breaking the journey into multiple stages, we will see how a business grows, how its funding needs change over time, and what situations eventually lead a company to list itself in the public markets."
                    }
                  ]
                },
                {
                  "id": 2,
                  "title": "Angel investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Let us begin our story. Imagine an enthusiastic entrepreneur who has a business idea — to manufacture trendy, organic cotton t-shirts. The designs are distinctive, the pricing is appealing, and premium quality cotton is used to produce the t-shirts. The entrepreneur is confident that the idea will succeed and is excited to turn it into a business.\n\nAs expected, the entrepreneur soon faces a common challenge — arranging funds to start the business. Since there is no prior business background, attracting professional investors at this early stage is difficult. In most such cases, the entrepreneur reaches out to close family members and friends to present the idea and raise initial capital.\n\nAssume that the entrepreneur invests some personal savings and also convinces two close friends to put money into the venture. These two friends decide to invest based on trust and belief in the entrepreneur. In this scenario, these friends are known as angel investors. It is important to note that angel funding is not a loan; it is an investment made in the business.\n\nNow, let us assume that the promoter (entrepreneur) along with the angel investors raise ₹5 crore as capital. This first round of funding, which helps the business begin its operations, is known as the Seed Fund. It is also sometimes referred to as a Friends and Family round. An important point to remember is that this money is deposited into the company’s bank account, not the personal account of the entrepreneur.\n\nAngel funding does not always come only from friends or relatives. There are also professional angel investors who invest in early-stage companies they believe have strong potential.\n\nIn exchange for this initial investment, the three individuals involved (the promoter and the two angels) are issued shares of the company, which gives them ownership in the business. At this stage, the company’s primary asset is cash. Therefore, the value of the company is largely based on the cash it holds. In this example, the valuation is ₹5 crore. One could argue that the company’s value should also include the strength of the business idea, which may push the valuation higher, but we will not go into that discussion here.\n\nIssuing shares at this stage is straightforward. The company assumes a face value of ₹10 per share. Since the total share capital is ₹5 crore, the company issues 50 lakh shares, each having a face value of ₹10. In this context, ₹10 is referred to as the Face Value (FV) of the share. The face value can typically be any amount, commonly ranging from ₹1 to ₹10."
                    }
                  ]
                },
                {
                  "id": 3,
                  "title": "venture capitalists",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "The entrepreneur’s efforts start showing results, and the business begins to generate steady revenues. By the end of the first two years, the company reaches a break-even point. The promoter is no longer inexperienced; instead, they now have a better understanding of the business and greater confidence in its potential. With this confidence, the promoter plans to scale the business by setting up an additional manufacturing unit and opening a few more retail outlets in the city. After working through the expansion plan, the entrepreneur estimates that ₹7 crore of fresh capital will be required.\n\nCompared to two years earlier, the entrepreneur is now in a much stronger position. The key difference is that the business is earning revenue. This consistent inflow validates both the business model and the product offering. At this stage, the entrepreneur can approach more informed and professional investors. Investors who typically fund businesses at this growth stage are known as Venture Capitalists (VCs), and the funding received at this point is referred to as Series A funding.\n\nLet us assume the entrepreneur successfully raises the required ₹7 crore for expansion. Generally, when new capital is infused into a business, the following outcomes occur:\n\nThe promoter’s ownership gets diluted as new shares are issued.\n\nThe overall valuation of the company increases.\n\nAs a result, the early investors (in this case, the angel investors) begin to see notional gains on their initial investment. With the entry of venture capital funding, the company’s valuation rises, leading to an increase in notional wealth for all existing shareholders."
                    }
                  ]
                },
                {
                  "id": 4,
                  "title": "Bankers and other investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Another three years go by, and the company achieves remarkable success. The business now plans to expand its retail presence to at least three additional cities. To support this expansion, the company needs to increase its manufacturing capacity and hire more resources. Any spending done to strengthen and grow the business in this manner is referred to as Capital Expenditure, commonly known as CAPEX.\n\nThe management estimates that around ₹40 crore will be required to meet these CAPEX needs. This raises an important question — how does the company arrange such a large amount of money, or in other words, how can the business fund its CAPEX plans?\n\nThere are a few common ways through which a company can raise funds for CAPEX:\n\nInternal accruals\nOver the past few years, the company has generated profits. A portion of the required CAPEX can be funded using these retained earnings. This method of funding is known as internal accruals.\n\nAnother round of venture capital funding\nThe company may approach another venture capitalist and raise fresh funds by issuing additional shares. This type of funding round is usually referred to as Series B funding.\n\nBank loan (Debt)\nThe company can also approach a bank for a loan. Since the business has been performing well, the bank may be willing to lend money. Such borrowing is commonly called debt.\n\nLet us assume the company uses all three options to fund its CAPEX. It contributes ₹15 crore from internal accruals, raises ₹10 crore by giving up some equity in a Series B funding round, and borrows ₹15 crore as debt from a bank.\n\nIt is important to note that the company’s valuation increases again due to the ₹10 crore raised through Series B funding. As valuations rise, earlier investors benefit by seeing higher notional gains on their investments."
                    }
                  ]
                },
                {
                  "id": 5,
                  "title": "Private Equity Investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "A few more years pass, and the company continues to perform well. With the success of this now 8-year-old business, ambitions grow larger. The company decides to expand its operations across the country. At the same time, it plans to diversify by entering new product categories such as fashion accessories, premium cosmetics, and perfumes.\n\nTo support these larger goals, the CAPEX requirement increases to ₹60 crore. The company chooses not to raise this money through debt because interest costs, also known as finance charges, reduce profitability. For example, if a company earns ₹100 in profit but pays ₹20 as interest, the effective profit comes down to ₹80. This impact of debt on profits will be discussed in more detail later in the Fundamental Analysis module.\n\nAt this stage, the company opts for Series C funding. Raising funds from a typical venture capitalist is not suitable anymore, as VC investments are generally smaller and usually limited to a few crores. This is where a Private Equity (PE) investor steps in. You can think of a PE investor as a more powerful and mature version of a VC. Some key differences between Venture Capital and Private Equity are outlined below:\n\nVenture Capital firms usually invest smaller amounts, whereas Private Equity firms invest significantly larger sums.\n\nVCs typically invest in early-stage businesses and take higher risks. PEs invest in more mature companies and therefore face relatively lower risk.\n\nPrivate Equity investors often take a seat on the company’s board and actively monitor and guide the company’s operations.\n\nPrivate Equity investors are generally highly experienced and professionally skilled. They invest substantial capital with the objective of long-term value creation. In addition, they place their representatives on the board of the investee company to ensure the business moves in the intended strategic direction."
                    }
                  ]
                },
                {
                  "id": 6,
                  "title": "The Initial public Offering",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Fast forward five years after the private equity investment, the company has grown significantly. It has successfully expanded its product range and established a presence in all major cities across the country. Revenues are strong, profitability is stable, and investors are satisfied. However, the promoter is not content with stopping here.\n\nThe promoter now aims to take the business global. The company plans to make its brand available in major international cities, with at least two outlets in each key global market.\n\nTo achieve this, the company needs to invest heavily in market research to understand international consumers, hire skilled talent, and further increase manufacturing capacity. In addition, the company must invest in real estate across different countries. The required CAPEX is substantial, and the management estimates this at around ₹200 crore. To fund this large CAPEX requirement, the company has several possible options:\n\nFund a part of the CAPEX using internal accruals\n\nRaise Series D funding from another private equity investor\n\nBorrow money from banks in the form of debt\n\nIssue bonds, which is another method of raising debt\n\nLaunch an Initial Public Offer (IPO)\n\nUse a combination of the above options\n\nFor simplicity, let us assume the company decides to fund a portion of the CAPEX through internal accruals and raise the remaining amount by launching an IPO. When a company files for an IPO, it offers its shares to the general public for the first time. Members of the public can choose to buy these shares by paying a specified price. Since this is the company’s first offer of shares to public investors, it is called an Initial Public Offer.\n\nAt this stage, we reach an important turning point where several key questions arise:\n\nWhy did the company choose to file for an IPO?\n\nIn general, why do companies decide to go public?\n\nWhy did the company not opt for an IPO during the earlier Series A, B, or C funding stages?\n\nWhat happens to the existing shareholders once the company goes public?\n\nWhat factors does the general public consider before subscribing to an IPO?\n\nHow does the IPO process unfold step by step?\n\nWhich financial intermediaries are involved in the IPO process?"
                    }
                  ]
                },
                {
                  "id": 7,
                  "title": "Why companies need to list on Market",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "The previous sections helped explain how a business grows from an initial idea to a stage where it considers launching an IPO. The purpose of that illustrative journey was to show how companies mature over time. While several real-world complexities were intentionally simplified, the focus was on highlighting the different growth phases of a business and the funding choices available at each stage.\n\nUnderstanding the reasons behind an IPO is very important, as the IPO market—also known as the primary market—often attracts first-time investors. In this section, we will explore the IPO process and the various factors that influence a company’s decision to go public.\n\nWe ended the earlier section with an important question: why does a company choose to file for an IPO? More broadly, what motivates companies to enter the public markets?\n\nWhen a company plans an IPO, one of the primary reasons is to raise capital to fund its CAPEX requirements. Apart from this, there are several other motivations. In some cases, companies use IPO proceeds to reduce expensive debt. In other situations, an IPO allows early investors to partially or fully exit their investments. Think of any company that went public recently and look up its IPO rationale—you will understand the reason behind its listing.\n\nFor promoters, taking a company public offers several key advantages:\n\nRaising funds for CAPEX needs\nAn IPO provides access to large amounts of capital required for expansion and long-term growth.\n\nReducing dependence on debt\nBy raising equity instead of borrowing, the company avoids interest costs, which improves overall profitability.\n\nRisk distribution\nThe promoter can spread business risk across a large base of investors rather than relying on a single large investor. Having thousands of retail investors is often preferable to depending on one private equity firm.\n\nThere are additional benefits of going public:\n\nExit opportunity for early investors\nOnce the company is listed, its shares can be freely traded in the market. Existing shareholders such as promoters, angel investors, venture capitalists, or private equity funds can sell their shares and realize returns on their initial investments (subject to lock-in rules).\n\nEmployee rewards through ownership\nEmployees may be granted shares as part of incentive plans known as Employee Stock Option Plans (ESOPs). These shares are usually allotted at a discounted price. After listing, employees can benefit from appreciation in the company’s share price, aligning their interests with the company’s growth."
                    }
                  ]
                },
                {
                  "id": 8,
                  "title": "The merchant bankers",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Once a company decides to go public, it needs to complete several important steps to ensure a smooth and successful IPO. One of the very first and most critical steps is appointing a merchant banker. Merchant bankers are also known as Book Running Lead Managers (BRLMs) or Lead Managers (LMs).\n\nThe primary responsibility of a merchant banker is to guide and support the company through different stages of the IPO process. Their key roles include:\n\nDue diligence – Conduct a detailed review of the company planning to launch an IPO, ensure regulatory and legal compliance, and issue a due diligence certificate.\n\nPreparation of IPO documents – Work closely with the company to draft and finalize important listing documents, including the Draft Red Herring Prospectus (DRHP). This will be discussed in more detail later.\n\nUnderwriting the issue – In underwriting, merchant bankers agree to subscribe to the portion of the IPO that remains unsubscribed. This applies to newly issued shares in the IPO. If the subscription falls short of a specified threshold, the IPO is considered unsuccessful, and investors’ blocked funds are released. If the subscription is above the threshold but not fully subscribed, the merchant banker absorbs the remaining shares.\n\nPrice band determination – Assist the company in deciding the IPO price band, which defines the lower and upper price limits at which shares are offered to investors. For example, an IPO may have a price band ranging between two specified prices.\n\nRoadshows and promotion – Support the company in conducting roadshows, which are marketing and promotional activities aimed at generating investor interest in the IPO.\n\nAppointment of other intermediaries – Help the company select and appoint other key entities involved in the IPO process, such as registrars, bankers, and advertising agencies.\n\nOverall, merchant bankers play a central role in coordinating the IPO process and ensuring that the company meets regulatory requirements while successfully raising capital from the public markets."
                    }
                  ]
                },
                {
                  "id": 9,
                  "title": "The way to IPO event",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Every step in the IPO journey must follow SEBI regulations. Broadly, an IPO moves through the following stages:\n\nAppointment of a merchant banker\nThe company first appoints a merchant banker. In the case of a large public issue, more than one merchant banker may be appointed.\n\nFiling with SEBI (Registration Statement)\nThe company submits a registration statement to SEBI. This document explains the company’s business, the reason for going public, and its financial condition.\n\nSEBI’s approval\nAfter reviewing the registration statement, SEBI decides whether to grant approval or reject the proposal. Only after a positive nod can the company proceed further.\n\nDraft Red Herring Prospectus (DRHP)\nOnce SEBI grants initial approval, the company prepares the DRHP. This document is circulated to the public and contains detailed information such as:\n\nEstimated size of the IPO\n\nApproximate number of shares to be offered\n\nPurpose of raising funds and planned utilization timeline\n\nBusiness overview, revenue model, and expense structure\n\nComplete financial statements\n\nManagement Discussion and Analysis (future outlook of the business)\n\nKey risks associated with the business\n\nDetails of management and their background\n\nMarketing the IPO\nThe company promotes its IPO through advertisements and media campaigns to create investor awareness. This phase is commonly referred to as the IPO roadshow.\n\nFinalizing the price band\nThe company decides the lower and upper price limits at which shares will be offered. The price band must align with investor expectations; otherwise, the IPO may fail to attract subscriptions.\n\nBook Building\nAfter the roadshow and price band announcement, the IPO subscription window opens. Investors bid for shares within the price band. The process of collecting bids at different price levels is called Book Building, which helps discover the most appropriate issue price.\n\nClosure of the issue\nOnce the subscription window closes (usually after a few days), the final issue price is determined. This price is typically the level at which maximum demand is received.\n\nListing day\nOn the listing day, the company’s shares are listed on the stock exchange. The listing price is decided by market demand and supply and may be at a premium, at par, or at a discount compared to the issue price."
                    }
                  ]
                },
                {
                  "id": 10,
                  "title": "What things happens after listing on Market ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "During the bidding phase, investors place bids for shares at a chosen price within the declared price band. This entire mechanism is known as the Primary Market, where investors apply for shares around the time of the issue.\n\nOnce the shares are listed and begin trading on the stock exchange, they become available for public trading. This stage is referred to as the Secondary Market.\n\nAfter moving from the primary market to the secondary market, the stock is traded on a daily basis on the exchange. Investors regularly buy and sell these listed shares in the open market.\n\nWhy do people trade shares? Why do stock prices move up and down? These questions, along with several others, will be explored in detail in the upcoming chapters."
                    }
                  ]
                },
                {
                  "id": 11,
                  "title": "Some most important jargon",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Before concluding the discussion on IPOs, let us go through some commonly used IPO-related terms.\n\nUnder-subscription – Suppose a company plans to offer 1,00,000 shares to the public. During the book-building process, if bids are received for only 90,000 shares, the issue is said to be under-subscribed. This usually reflects weak demand and unfavorable public sentiment.\n\nOversubscription – If the company offers 1,00,000 shares and receives bids for 2,00,000 shares, the IPO is considered oversubscribed by two times (2x). This indicates strong investor interest.\n\nGreen Shoe Option – This is a provision in the issue document that allows the company to issue additional shares (generally up to 15%) in case of excess demand. It is also known as the over-allotment option.\n\nFixed Price IPO – In some IPOs, the company decides a single fixed price for the shares instead of offering a price band. Such offerings are referred to as fixed-price IPOs.\n\nPrice Band and Cut-off Price – A price band represents the lower and upper price range within which investors can bid. For example, if the price band is ₹100 to ₹130 and the shares are finally allotted at ₹125, then ₹125 is known as the cut-off price.\n\nRecent IPOs in India\n\nBelow is a snapshot of some recent IPOs in India. With the concepts covered so far, understanding this information should now be straightforward.\n\nThe previous sections aim to give you a clear understanding of why companies choose to go public and how the IPO process works end-to-end."
                    }
                  ]
                },
                {
                  "id": 12,
                  "title": "How to take subscription of an IPO",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Before we conclude the IPO discussion, it is important to understand a few commonly used terms related to IPO subscriptions.\n\nConsider this example: a company decides to offer 1,000 shares to the public as part of its IPO. The company is very popular and attracts strong investor interest. Against the 1,000 shares available, applications are received for 2,200 shares, which is 1,200 shares more than what is on offer. This situation is known as oversubscription.\n\nOn the other hand, if out of the 1,000 shares offered, bids are received for only 900 shares, then the IPO is said to be undersubscribed.\n\nNow, think about what happens after the company gets listed. What if the share price starts declining immediately after listing? This can certainly happen. To address such situations, there is a mechanism known as the Greenshoe Option. Under this option, the underwriters are allowed to purchase up to an additional 15% of the shares at the issue price if the newly listed stock begins to trade below its offer price. This process helps stabilize and support the falling share price in the market."
                    }
                  ]
                }
              ]
            }
          ]
        },

        {
          "id": 2,
          "name": "MASTERMIND",
          "image": "mastermind",
          "topCard": {
            "title": "MASTERMIND",
            "description": "Dive deeper into price movement of stocks and also understand ways to compare return on investments"
          },
          "chapters": [
            {
              "id": 1,
              "title": "Stock Market",
              "description": "It will help you to build understanding why and how price moves of a specific stock on exchanges continuously ",
              "image": "stock",
              "slides": [
                {
                  "id": 1,
                  "title": "What is a public limited company ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Now that we have understood the IPO process and the situations that prompt a company to offer its shares to the public in order to raise capital, we are ready to take the discussion a step further and explore how stock markets function.\n\nOnce a company becomes publicly listed, it is legally required to disclose all relevant information about its business to the public. The shares of a public limited company are traded daily on stock exchanges. There are several reasons why different market participants buy and sell stocks, and in this chapter, we will look into some of those reasons in detail."
                    }
                  ]
                },
                {
                  "id": 2,
                  "title": "What is stock market ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "As discussed earlier, the stock market is an electronic marketplace where buyers and sellers express their opinions through buying and selling activity.\n\nFor example, consider a situation involving Infosys. At a certain point in time, Infosys faces a management transition issue, with several senior executives stepping down. This leadership uncertainty negatively impacts the company’s image. As a result, the stock price falls from Rs. 3,500 to Rs. 3,000. Now, assume there are two traders — A and B.\n\nTrader A’s view on Infosys – A believes that the stock price may decline further because the company could struggle to appoint a new CEO quickly. Based on this perspective, A decides to sell Infosys shares.\n\nTrader B’s view on Infosys – B interprets the same situation differently. She feels the stock has overreacted to the management issue and believes the company will soon appoint a strong leader. Over time, she expects the stock price to recover and move higher.\n\nIf B acts based on her viewpoint, she would choose to buy Infosys shares.\n\nTherefore, at Rs. 3,000, trader A becomes a seller, while trader B becomes a buyer of Infosys stock.\n\nBoth A and B place their respective buy and sell orders through their stockbrokers. These orders are then routed to the stock exchange. The exchange’s responsibility is to match the buy and sell orders and ensure that the trade is successfully executed. This is the core function of the stock market — to enable smooth transactions between various market participants.\n\nIn simple terms, the stock market allows participants to access shares of publicly listed companies and trade them based on their individual views and expectations."
                    }
                  ]
                },
                {
                  "id": 3,
                  "title": "How stock moves ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Let us continue with the Infosys example to understand how stock prices react to events. Assume you are a market participant closely tracking Infosys.\n\nAt 10:00 AM, Infosys is trading at Rs. 3,000 per share. The company then releases a press statement announcing that a new CEO has been appointed. The management expresses confidence that the new CEO will lead the company towards stronger growth and improved performance.\n\nThis raises two important questions:\n\nHow is Infosys’ stock price likely to respond to this announcement?\n\nIf you were to take a position in Infosys, would you choose to buy or sell the stock?\n\nThe answer to the first question is fairly straightforward. Since the news is positive, the stock price is expected to rise. Infosys was previously facing a leadership concern, and this uncertainty has now been resolved. Whenever positive developments are announced, market participants generally respond by buying the stock at prevailing prices, which often triggers a price rally.\n\nLet’s understand this with a simple illustration.\n\nYou will notice that buyers are willing to accept higher prices quoted by sellers. This behavior indicates a bullish market. In a bullish environment, stock prices tend to move upward as demand outweighs supply.\n\nAs you can see, the stock price increases by Rs. 16 within just 5 minutes. Although this is a hypothetical example, it closely reflects real market behavior. Stock prices typically rise when the news is favorable or when future expectations improve.\n\nIn this scenario, the upward movement in the stock price is driven by positive sentiment and renewed confidence in the company’s leadership."
                    }
                  ]
                },
                {
                  "id": 4,
                  "title": "What moves the stock ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Now, moving ahead on the same day, at 12:30 PM, the National Association of Software & Services Companies (NASSCOM) releases a statement saying that IT budgets of clients are expected to decline by 15%, which could negatively impact the IT sector going forward. For those unfamiliar, NASSCOM is a trade body representing the Indian IT industry.\n\nBy 12:30 PM, let us assume Infosys is trading at Rs. 3030. A few questions arise now:\n\nHow does this new information affect Infosys?\n\nIf you were to place a fresh trade based on this update, what would you do?\n\nWhat impact would this news have on other IT stocks?\n\nBefore answering these questions, let us understand the NASSCOM statement in detail.\n\nA likely 15% reduction in IT budgets means that IT companies may see lower revenues and profits in the future. This is clearly negative news for the IT industry as a whole.\n\nNow let us answer the above questions:\n\nInfosys is a leading IT company, and the market will react to this news. Since there was already positive news earlier in the day, the reaction may be mixed. However, a 15% drop in revenue expectations is serious, and hence Infosys’ stock is likely to face selling pressure.\n\nAt Rs. 3030, if one were to initiate a new trade based on this information, it would most likely be a sell on Infosys.\n\nThe statement issued by NASSCOM affects the entire IT sector, not just Infosys. Therefore, most IT stocks are likely to witness selling pressure.\n\nAs you can see, market participants constantly react to news and events, and these reactions directly translate into price movements. This is essentially what causes stock prices to move.\n\nAt this point, you may wonder whether prices move only when there is news. The answer is yes and no, depending on the company and the context.\n\nFor example, consider two companies where there is no specific news:\n\nReliance Industries Limited\n\nShree Lakshmi Sugar Mills\n\nReliance Industries is a large, widely tracked company. Even in the absence of news, market participants actively buy and sell its shares, which causes continuous price movement.\n\nThe second company is relatively lesser-known and may not attract much attention when there is no news. In such cases, the stock price may not move much, or the movement may be very small.\n\nTo summarize, stock prices move based on expectations driven by news and events. These events may relate to the company itself, the industry it belongs to, or even the broader economy. For instance, the appointment of Narendra Modi as the Prime Minister of India was perceived as positive news, which led to a rise in the overall stock market.\n\nIn some situations, even when there is no news, prices can still move purely due to demand and supply dynamics in the market."
                    }
                  ]
                },
                {
                  "id": 5,
                  "title": "How stock got traded ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Suppose you decide to buy 200 shares of Infosys at Rs. 3030 and plan to hold them for one year. How does this actually work? What is the exact process of purchasing the stock, and what happens once the transaction is completed?\n\nBehind the scenes, multiple systems work together smoothly to ensure that your transaction is executed without issues.\n\nOnce you decide to buy Infosys shares, you need to log in to your trading account (provided by your stock broker) and place a buy order. When you place the order, the following details are verified:\n\nYour trading account details through which you are placing the order\n\nThe price at which you wish to buy Infosys shares\n\nThe number of shares you intend to purchase\n\nBefore sending the order to the stock exchange, your broker checks whether you have sufficient funds in your account to complete the purchase. If sufficient funds are available, the order is forwarded to the stock exchange.\n\nOnce the order reaches the exchange, its order-matching system looks for a seller who is willing to sell 200 shares of Infosys at Rs. 3030.\n\nThe seller could be a single person selling all 200 shares, or multiple sellers selling smaller quantities—such as ten sellers offering 20 shares each, or two sellers offering 1 and 199 shares respectively. From your point of view, this breakdown does not matter. What matters is that your requirement of 200 shares at Rs. 3030 is fulfilled. The stock exchange ensures this as long as sellers are available in the market.\n\nAfter the trade is executed, the shares are electronically credited to your DEMAT account. At the same time, the shares are electronically debited from the seller’s DEMAT account, completing the transaction."
                    }
                  ]
                },
                {
                  "id": 6,
                  "title": "How you own a stock ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Once you purchase shares, they are credited to your DEMAT account. At this point, you officially become a part-owner of the company, in proportion to the number of shares you hold. To put this into perspective, if you own 200 shares of Infosys, you hold approximately 0.000035% ownership in the company (at the time this chapter was written).\n\nAs a shareholder, you are entitled to various corporate benefits, such as dividends, stock splits, bonus issues, rights issues, and voting rights, among others. We will explore each of these shareholder privileges in more detail at a later stage."
                    }
                  ]
                },
                {
                  "id": 7,
                  "title": "Holding period",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "The holding period refers to the length of time you plan to keep a stock after purchasing it. Interestingly, this duration can range from just a few minutes to an entire lifetime. In fact, when the legendary investor Warren Buffett was once asked about his preferred holding period, his answer was simple — “forever.”\n\nEarlier in this chapter, we saw an example where Infosys moved from ₹3000 to ₹3016 within just five minutes. That’s actually a decent return for such a short holding period. If you’re happy with the gain, you can exit the trade and look for the next opportunity.\n\nIt’s important to remember that such price movements are very much possible in real markets. When market conditions are active and sentiment is strong, short-term price jumps like these are quite common."
                    }
                  ]
                },
                {
                  "id": 8,
                  "title": "Calculate Returns",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Now, when it comes to the markets, everything ultimately boils down to one core objective — earning a reasonable return. If a trade delivers good returns, most past mistakes tend to be overlooked. Returns are generally measured on an annual basis, and there are multiple ways to look at and calculate them. The following section will help you understand the different types of returns and how they are computed.\n\nAbsolute Return –\nThis refers to the total return generated by an investment or trade in simple percentage terms. It helps answer a straightforward question such as:\n“I bought Infosys at ₹3030 and sold it at ₹3550. What percentage gain did I make?”\n\nThe formula to calculate Absolute Return is:\n\nAbsolute Return\n=\n(\nEnding Value\nStarting Value\n−\n1\n)\n×\n100\nAbsolute Return=(\nStarting Value\nEnding Value\n\t​\n\n−1)×100\n\nExample:\n\n(\n3550\n3030\n−\n1\n)\n×\n100\n(\n3030\n3550\n\t​\n\n−1)×100\n=\n0.1716\n×\n100\n=0.1716×100\n=\n17.16\n%\n=17.16%\n\nA return of 17.16% is definitely a healthy outcome for any investment."
                    }
                  ]
                },
                {
                  "id": 9,
                  "title": "CAGR",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Compounded Annual Growth Rate (CAGR) –\nAbsolute returns can sometimes be misleading, especially when you want to compare investments held over different time periods. CAGR helps answer questions like:\n“I bought Infosys at ₹3030, held it for two years, and sold it at ₹3550. At what yearly rate did my investment grow during this period?”\n\nCAGR takes the time factor into account, which we ignored while calculating absolute returns.\n\nThe formula to calculate CAGR is:\n\nCAGR\n=\n(\nEnding Value\nBeginning Value\n)\n1\nNumber of Years\n−\n1\nCAGR=(\nBeginning Value\nEnding Value\n\t​\n\n)\nNumber of Years\n1\n\t​\n\n−1\n\nApplying this to the example:\n\n(\n3550\n3030\n)\n1\n2\n−\n1\n=\n8.2\n%\n(\n3030\n3550\n\t​\n\n)\n2\n1\n\t​\n\n−1=8.2%\n\nThis means the investment grew at an annual rate of 8.2% over two years.\nConsidering that bank fixed deposits currently offer around 5.5% with capital protection, an 8.2% return appears reasonably attractive in comparison.\n\nSo, as a rule of thumb, use CAGR when evaluating returns over multiple years. Absolute returns are more suitable when the investment period is one year or less."
                    }
                  ]
                },
                {
                  "id": 10,
                  "title": "Are you a trader ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Every participant in the market follows a distinct way of operating. This style evolves as you gain experience and observe different market cycles. Your approach is also influenced by the level of risk you are comfortable taking. Broadly, regardless of the method you choose, you will fall into one of two categories — a trader or an investor.\n\nA trader is someone who identifies opportunities and enters trades with the intention of exiting them profitably at the earliest suitable moment. Traders typically have a short-term outlook on the markets. They remain alert during market hours and continuously assess opportunities by balancing risk and reward. A trader is neutral about market direction and can take positions on both the upside (long) and downside (short). The concepts of going long and going short will be explained later.\n\nThere are different types of traders:\n\nDay Trader –\nA day trader opens and closes positions within the same trading day and does not carry positions overnight. This approach avoids overnight risk. For example, buying 100 shares of TCS at ₹2212 at 9:15 AM and selling them at ₹2220 at 3:20 PM results in a profit of ₹800 in a single day. A day trader usually trades in 5–6 stocks daily, sometimes even more.\n\nScalper –\nA scalper is a specialized form of a day trader. Scalpers trade very large quantities of shares for extremely short durations, aiming for small but quick profits. For instance, buying 10,000 shares of TCS at ₹2212 at 9:15 AM and selling them at ₹2212.1 at 9:16 AM yields a profit of ₹1000. Scalpers may repeat such trades multiple times during the day and are typically highly risk-averse.\n\nSwing Trader –\nA swing trader holds positions for a relatively longer period compared to a day trader. The holding duration can range from a few days to several weeks, aiming to capture short- to medium-term price movements."
                    }
                  ]
                },
                {
                  "id": 11,
                  "title": "Do you fit into investor ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "An investor is someone who purchases a stock with the expectation that its value will grow meaningfully over time. Unlike a trader, an investor is patient and allows the investment to mature. Investors are comfortable waiting for the business to grow and deliver results. Typically, an investor’s holding period spans several years rather than days or weeks. Broadly, investors can be grouped into two popular categories.\n\n1. Growth Investors\n\nThe goal of a growth investor is to identify companies that are expected to expand rapidly due to favorable industry dynamics, innovation, or long-term macroeconomic trends. These investors focus on future potential rather than current valuations.\n\nA classic example in the Indian market would be investing in companies like Hindustan Unilever, Infosys, or Gillette India during the 1990s. As industries evolved and consumer demand increased, these companies experienced substantial growth, creating enormous wealth for long-term shareholders.\n\n2. Value Investors\n\nValue investors aim to find fundamentally strong companies whose stock prices have fallen significantly due to temporary negative sentiment or short-term challenges. These stocks may belong to either growing or mature businesses but are available at attractive valuations.\n\nA recent example of value investing can be seen during the market crash caused by Covid in March 2020. Due to widespread fear and uncertainty, many high-quality stocks were heavily sold off. However, as sentiment improved, these stocks staged a strong V-shaped recovery in the following months, rewarding patient value investors."
                    }
                  ]
                },
                {
                  "id": 12,
                  "title": "Other Stocks",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "What if there is no fresh news? Does that mean the stock price will remain unchanged? Not necessarily. Price movement depends largely on the company being observed. Let us assume there is no news related to:\n\nReliance Industries\n\nShree Lakshmi Sugar Mills\n\nReliance is among the largest companies in India. With or without news, market participants actively buy and sell its shares. Due to this constant interest and liquidity, the stock price keeps moving regularly.\n\nThe second company is relatively lesser known. As a result, it may not attract much attention from market participants. In such cases, the stock price may remain stagnant, or even if it moves, the movement is usually minimal.\n\nTo sum up, stock prices are primarily influenced by news and events. These developments may be directly linked to the company, the industry it operates in, or the overall economy. For example, the appointment of Narendra Modi as the Prime Minister of India was seen as a positive event, leading to a broad-based rise across the stock market.\n\nAt times, even in the absence of any news, stock prices can still change due to shifts in demand and supply dynamics."
                    }
                  ]
                },
                {
                  "id": 13,
                  "title": "Compounded Annual Growth Rate (CAGR)",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Absolute return can sometimes give a misleading picture when you are comparing two different investments. This is where Compounded Annual Growth Rate (CAGR) becomes useful. CAGR helps answer questions like:\n“I bought Infosys at ₹3030, held the stock for two years, and sold it at ₹3550. What return did this investment generate?”\n\nCAGR incorporates the time factor, which was ignored while calculating absolute returns.\n\nThe formula to calculate CAGR is:\n\nCAGR\n=\n(\nEnding Value\nBeginning Value\n)\n1\nNumber of Years\n−\n1\nCAGR=(\nBeginning Value\nEnding Value\n\t​\n\n)\nNumber of Years\n1\n\t​\n\n−1\n\nApplying this to the example:\n\n(\n3550\n3030\n)\n1\n2\n−\n1\n=\n8.2\n%\n(\n3030\n3550\n\t​\n\n)\n2\n1\n\t​\n\n−1=8.2%\n\nThis implies that the investment grew at an annual rate of 8.2% year-on-year over a period of two years.\n\nConsidering that fixed deposits generally offer returns close to 7% with capital protection, an 8.2% CAGR may not appear very attractive when compared to a fixed deposit.\n\nAs a guideline, use CAGR to evaluate returns over multiple years, and rely on absolute return when your investment horizon is one year or less.\n\nIf you had bought Infosys at ₹3030 and sold it at ₹3550 within six months, the return generated would be 17.16% in six months."
                    }
                  ]
                }
              ]
            },
            {
              "id": 2,
              "title": "Indexes",
              "description": "In this chapter you will understand indexes their importance and how they are useful in real world application or day to day trading. ",
              "image": "stock",
              "slides": [
                {
                  "id": 1,
                  "title": "An overview",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Imagine someone asks you:\n“What’s the traffic situation in your city right now?”\n\nYour city has thousands of roads, but you won’t check each road one by one.\nInstead, you’ll look at a few important roads and junctions in different areas.\n\nIf most of them are crowded → traffic is bad\n\nIf most are smooth → traffic is normal\n\nThose few important roads act as a summary or indicator of the entire city’s traffic.\n\nSame logic applies to the stock market\n\nNow think about the stock market:\n\nThere are ~5,000 companies on BSE\n\n~2,000 companies on NSE\n\nChecking every stock to know how the market is doing is impractical.\n\nSo instead:\n\nWe pick a few important companies\n\nThese companies belong to key industries\n\nWe observe how most of them are moving\n\n👉 If most are rising → market is up\n👉 If most are falling → market is down\n👉 If mixed → market is sideways/flat\n\nWhat is an Index then?\n\nAn Index is:\n\nA collection of selected important stocks\n\nThat represents the overall market\n\nJust like key roads represent city traffic\n\nWhenever someone asks:\n\n“How is the market today?”\n\nYou don’t look at every stock —\nYou simply check the index.\n\n✅ These selected stocks together form the stock market index.\n\nIn one line\n\nAn index is a benchmark that tells you how the overall market is performing by tracking a few representative stocks."
                    }
                  ]
                },
                {
                  "id": 2,
                  "title": "Index",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "You do not need to track individual companies one by one to understand how the stock market is performing.\nInstead, a selected group of important companies is continuously monitored to give a quick and accurate sense of overall market movement.\n\nThis pre-packaged indicator of market sentiment is called a Stock Market Index.\n\nAn index acts like a summary of the market, helping investors understand whether the market is generally moving up, down, or sideways.\n\nImportant Indices in India\n\nIndia has several widely tracked stock market indices:\n\nSensex\nRepresents the Bombay Stock Exchange (BSE). It consists of 30 large, well-established companies.\n\nNifty 50\nRepresents the National Stock Exchange (NSE). It consists of 50 actively traded and influential companies.\n\nBank Nifty\nRepresents the banking sector as a whole. It tracks major banking stocks listed on the NSE.\n\nEach of these indices reflects the performance of a specific segment of the market.\n\nWhy “S&P” Sensex?\n\nS&P stands for Standard & Poor’s, a global credit rating and financial analytics company.\n\nS&P provides the technical expertise required to construct and maintain stock market indices.\n\nThis methodology is licensed to the BSE, which is why the index is called S&P BSE Sensex.\n\nFor the NSE:\n\nIndices are maintained by a separate entity called NSE Indices Limited.\n\nWhat Does Nifty 50 Represent?\n\nNifty 50 includes the most frequently traded and liquid stocks on the NSE.\n\nThese companies come from different sectors of the economy.\n\nTogether, they provide a reliable and updated representation of the overall market.\n\nAn ideal index:\n\nReflects market movements accurately\n\nIs regularly updated\n\nRepresents the broader economy, not just one company or sector\n\nIn short\n\nA stock market index is a carefully selected group of stocks that helps you understand how the overall market or a specific sector is performing—without tracking every individual company."
                    }
                  ]
                },
                {
                  "id": 3,
                  "title": "Use of index information",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Practical Uses of a Stock Market Index\n\nSome of the practical uses of a stock market index are discussed in this section.\n\nA stock market index reflects the overall sentiment and trend of the market. It broadly represents the state of the country’s economy.\n\nWhen the index is rising, it indicates that market participants are optimistic about the future.\n\nWhen the index is falling, it suggests pessimism about future economic prospects.\n\nUnderstanding Market Sentiment Using an Index\n\nFor example, the Nifty 50 value on 21st November 2022 was 18,150.\nAround six months earlier, the Nifty 50 was at 15,820.\n\nThis means:\n\nThe index moved up by 2,300 points\n\nA rise of approximately 14.75% in six months\n\nSuch a sharp upward movement indicates bullish sentiment in the market.\nIn other words, market participants were optimistic about the Indian economic future during this period.\n\nIndex Movement Across Different Time Frames\n\nThe time frame used to observe index movement can vary depending on the analysis.\n\nFor instance:\n\nAt 9:30 AM on 21st November, the index was at 18,140\n\nOne hour later, it dropped to 18,099\n\nThis represents a fall of nearly 40 points within an hour.\n\nSuch short-term movement indicates that:\n\nMarket participants were not enthusiastic in the short term\n\nShort-term sentiment can differ from long-term sentiment\n\nKey Takeaway\n\nA stock market index helps assess both long-term and short-term market sentiment\n\nLong-term trends reflect economic outlook\n\nShort-term movements reflect immediate reactions of market participants\n\nThis makes the index a powerful tool to understand how the market is feeling at any given point in time."
                    }
                  ]
                },
                {
                  "id": 4,
                  "title": "Practically benchmark index",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "A yardstick is required to measure performance for any trading or investing activity.\n\nAssume that over the last year:\n\nYou invested Rs. 100,000\n\nYou generated a return of Rs. 20,000\n\nYour total corpus became Rs. 120,000\n\nAt first glance, a 20% return appears impressive.\n\nHowever, consider this:\n\nWhat if the Nifty Index gained 30% during the same year?\n\nIn such a case, even though you made money, you actually underperformed the market.\n\nRole of the Index in Performance Evaluation\n\nThe primary objective of most market participants is to outperform the index, not just generate positive returns.\n\nWithout an index:\n\nYou cannot objectively judge how well you performed\n\nReturns lack context\n\nPerformance comparison becomes meaningless\n\nThe index provides a standard benchmark against which:\n\nTrading performance\n\nInvestment returns\n\nPortfolio efficiency\n\ncan be evaluated accurately.\n\nKey Takeaway\n\nAbsolute returns alone do not indicate good performance\n\nReturns must always be compared against a relevant market index\n\nThe index helps determine whether you have outperformed or underperformed the market."
                    }
                  ]
                },
                {
                  "id": 5,
                  "title": "How to trade an Index",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Trading on the index is one of the most popular uses of a stock market index.\n\nA majority of traders prefer trading the index rather than individual stocks. This is because index trading allows traders to take a broader view of the economy or overall market conditions and convert that view into a trade.\n\nIndex traders usually take short-term positions, aiming to benefit from near-term movements in the overall market rather than company-specific events.\n\nIllustrative Example\n\nConsider the following situation:\n\nAt 10:30 AM, the Finance Minister is scheduled to deliver the annual budget speech.\nAn hour before the announcement, the Nifty index is trading at 18,150 points.\n\nYou expect the budget to be favorable for the country’s economy.\n\nWhat do you think will happen to the index?\n\nIf the budget is perceived as positive, the index is likely to move upward, as it reflects the performance and expectations of the broader economy.\n\nTo express this view, you may choose to buy the index at 18,150.\n\nOutcome of the Trade\n\nAs expected, the budget announcement is positive.\nThe index rises to 18,450 points.\n\nYou can now:\n\nBook your profits\n\nExit the trade with a 300-point gain\n\nHow Is Index Trading Possible?\n\nTrading on the index is made possible through the derivatives segment of the stock market.\n\nWhile derivatives will be covered in detail later, it is important to understand at this stage that:\n\nDirect buying or selling of an index is not possible\n\nIndex exposure is achieved through derivative instruments\n\nKey Takeaway\n\nIndex trading allows traders to take a view on the overall market or economy\n\nIt is commonly used for short-term trading\n\nSuch trades are executed through the derivatives market"
                    }
                  ]
                },
                {
                  "id": 6,
                  "title": "Index-Portfolio Comparison",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Investors typically build a diversified portfolio of stocks.\nA standard equity portfolio often consists of 15 to 20 stocks, usually held with a long-term investment horizon.\n\nEven though these stocks are selected for long-term growth, investors may anticipate periods of prolonged market decline. Historical events such as the 2008 financial crisis demonstrate how broad market downturns can significantly erode portfolio value, even if the underlying companies remain fundamentally strong.\n\nIn such situations, investors can use the stock market index as a hedging tool.\n\nWhat Is Portfolio Hedging?\n\nPortfolio hedging refers to the practice of reducing or offsetting potential losses in an investment portfolio by taking an opposing position elsewhere.\n\nSince most diversified portfolios tend to move in line with the broader market:\n\nA market-wide fall can negatively impact the portfolio\n\nEven strong individual stocks may decline during market stress\n\nBy taking a position on the index, investors can protect their portfolio from large downside risks during adverse market conditions.\n\nRole of the Index in Hedging\n\nThe index represents the overall market movement.\nIf an investor expects a broad market decline, they can use index-based instruments to hedge their portfolio exposure."
                    }
                  ]
                },
                {
                  "id": 7,
                  "title": "How an index is constructed ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Index Construction Methodology\n\nUnderstanding how a stock market index is constructed is important, especially for participants who intend to trade or analyze the index in depth.\n\nAs discussed earlier, an index is a collection of selected stocks drawn from different sectors of the economy. These stocks together represent the overall state and movement of the economy.\n\nStock Selection Criteria\n\nTo be included in an index, a stock must satisfy certain predefined criteria. These criteria typically relate to:\n\nMarket capitalization\n\nLiquidity\n\nTrading frequency\n\nSector representation\n\nOnce a stock qualifies and becomes part of the index, it must continue to meet these criteria.\nIf a stock fails to maintain the required standards, it is removed and replaced by another eligible stock.\n\nThis ensures that the index remains relevant, representative, and efficient over time.\n\nWeightage of Stocks in an Index\n\nAfter the eligible stocks are selected, each stock is assigned a specific weight within the index.\n\nWeightage determines:\n\nHow much influence a stock has on index movement\n\nThe extent to which price changes in that stock affect the index\n\nFor example, if a stock has a weight of 3.85% in the index, it means approximately 3.85% of the index’s movement can be attributed to that stock’s price movement.\n\nHow Are Weights Assigned?\n\nThere are multiple ways to assign weights, but Indian stock exchanges follow the free-float market capitalization method.\n\nUnder this method:\n\nStocks with a larger free-float market capitalization receive higher weight\n\nStocks with smaller free-float market capitalization receive lower weight\n\nThis approach ensures that companies with greater market participation have a proportionally higher impact on the index.\n\nFree-Float Market Capitalization\n\nFree-float market capitalization is calculated as:\n\nNumber of shares available for public trading × Market price per share\n\nOnly shares that are freely available for trading are considered. Promoter-held shares and restricted shares are excluded.\n\nExample:\nIf a company has:\n\n100 shares available in the market\n\nShare price of ₹50\n\nThen, free-float market capitalization =\n100 × 50 = ₹5,000\n\nImpact of Heavyweight Stocks\n\nStocks with the highest weight in the index are called index heavyweights.\n\nMovements in these stocks have a significant impact on the index level.\nAs a result, the index tends to be more sensitive to price changes in heavyweight stocks compared to lower-weight stocks.\n\nKey Takeaways\n\nAn index is constructed using a defined stock selection process\n\nEach stock is assigned a weight based on free-float market capitalization\n\nHigher market capitalization leads to higher index weight\n\nHeavyweight stocks influence index movement the most"
                    }
                  ]
                },
                {
                  "id": 8,
                  "title": "Sectoral indices",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Sector-Specific Indices\n\nWhile broad market indices such as the Sensex and Nifty represent the overall stock market, there are indices that track the performance of specific sectors of the economy. These are known as sectoral indices.\n\nSectoral indices help investors and traders understand how a particular industry or sector is performing, independent of the broader market.\n\nExamples of Sectoral Indices\n\nBank Nifty (NSE)\nRepresents the performance and sentiment of the banking sector. It includes major public and private sector banks listed on the NSE.\n\nCNX IT (NSE)\nRepresents the performance of the information technology sector and reflects the collective movement of IT stocks in the market.\n\nBoth the BSE and NSE maintain multiple sector-specific indices covering industries such as banking, IT, FMCG, metals, pharmaceuticals, energy, and infrastructure.\n\nPurpose of Sectoral Indices\n\nSectoral indices are useful for:\n\nTracking sector-specific trends and cycles\n\nComparing performance across different industries\n\nMaking sector rotation decisions\n\nTrading or investing based on industry-level outlooks\n\nConstruction and Maintenance\n\nThe construction and maintenance of sectoral indices follow the same principles as broader market indices:\n\nStock selection based on predefined eligibility criteria\n\nWeight assignment using free-float market capitalization\n\nPeriodic review and rebalancing\n\nThis ensures that sectoral indices remain representative of the sectors they track.\n\nKey Takeaway\n\nBroad indices reflect the overall market\n\nSectoral indices reflect the performance of individual industries\n\nThey provide deeper insight into sector-specific opportunities and risks"
                    }
                  ]
                },
                {
                  "id": 9,
                  "title": "Indices",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Market Index\n\nFortunately, you do not need to track individual companies to understand how the overall stock market is performing. A selected group of important companies is pre-chosen and continuously monitored to provide a snapshot of the broader market’s performance.\n\nThese pre-selected stocks, when taken together, are referred to as the Market Index.\n\nMajor Market Indices in India\n\nThere are two primary stock market indices in India:\n\nS&P BSE Sensex – Represents the Bombay Stock Exchange (BSE)\n\nNifty 50 – Represents the National Stock Exchange (NSE)\n\nBoth indices are professionally constructed, maintained, and regularly monitored to reflect market sentiment accurately.\n\nAbout the S&P BSE Sensex\n\nS&P stands for Standard & Poor’s, a global credit rating agency.\nS&P provides the technical expertise required to construct the index, which has been licensed to the Bombay Stock Exchange. This is why the index carries the S&P prefix.\n\nAbout the Nifty 50\n\nThe Nifty 50 consists of the largest and most actively traded stocks listed on the National Stock Exchange. These stocks are selected based on liquidity, market capitalization, and representation across key sectors of the economy.\n\nThe Nifty 50 is maintained by India Index Services & Products Limited (IISL), a subsidiary of the NSE.\n\nKey Takeaway\n\nMarket indices provide a quick and reliable measure of overall market performance\n\nSensex represents the BSE, while Nifty 50 represents the NSE\n\nIndices eliminate the need to track individual stocks to understand market direction."
                    }
                  ]
                },
                {
                  "id": 10,
                  "title": "How to benchmark ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Benchmarking Performance Using the Index\n\nFor any trading or investing activity, a benchmark is required to evaluate performance objectively. Consider the following example.\n\nAssume that over the last one year, you invested Rs.100,000 and generated a return of Rs.20,000, resulting in a total corpus of Rs.120,000. On the surface, a 20% return appears to be a strong performance.\n\nHowever, suppose during the same period the Nifty index moved from 10,000 to 13,000, delivering a return of 30%.\n\nUnderstanding Relative Performance\n\nIn this situation, although your investment generated positive returns, it becomes evident that your portfolio underperformed the broader market.\n\nWithout referencing the market index, it would be difficult to determine whether your performance was good or poor. The index provides the necessary context to evaluate results accurately.\n\nRole of the Index as a Benchmark\n\nThe index serves as a benchmark to measure the performance of traders and investors. It allows participants to compare their returns against the broader market.\n\nIn most cases, the objective of a market participant is not merely to generate profits, but to outperform the index.\n\nKey Takeaway\n\nAbsolute returns alone do not indicate true performance\n\nThe index provides a standardized benchmark\n\nPerformance should always be evaluated relative to the market."
                    }
                  ]
                },
                {
                  "id": 11,
                  "title": "What is market capitalization ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Index Weighting Methodology\n\nThere are several ways to assign weights to the stocks that make up an index. However, Indian stock exchanges follow a methodology known as free-float market capitalization.\n\nUnder this method, the weight assigned to a stock in the index depends on its free-float market capitalization. A company with a higher free-float market capitalization carries a higher weight in the index.\n\nFree-Float Market Capitalization\n\nFree-float market capitalization is calculated as the product of the total number of shares available for trading in the market and the current market price of the stock.\n\nIn simpler terms, it reflects the market value of shares that are actively traded and excludes shares held by promoters or other long-term holders that are not readily available in the market.\n\nIllustrative Example\n\nConsider a company, ABC, with 100 shares outstanding in the market. If the stock price is ₹50, the free-float market capitalization of the company would be:\n\n100 × 50 = ₹5,000\n\nThis value is used to determine the stock’s weight in the index relative to other constituent stocks."
                    }
                  ]
                },
                {
                  "id": 12,
                  "title": "What is sector specific ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Sector-Specific Indices\n\nWhile indices such as the Sensex and Nifty represent the broader market, certain indices are designed to track the performance of specific sectors. These are referred to as sector-specific indices.\n\nFor example, the Bank Nifty index on the National Stock Exchange represents the performance of stocks belonging to the banking industry. It reflects the overall sentiment and movement specific to the banking sector.\n\nSimilarly, the IT Index on the National Stock Exchange represents the performance of Information Technology companies listed on the exchange. It captures the collective behavior of IT stocks in the market.\n\nConstruction of Sectoral Indices\n\nBoth the Bombay Stock Exchange (BSE) and the National Stock Exchange (NSE) maintain multiple sector-specific indices. The methodology used to construct and maintain these indices is similar to that of the broader market indices.\n\nStocks are selected based on predefined criteria, assigned appropriate weights, and reviewed periodically to ensure accurate representation of the sector.\n\nImportant Note\n\nIt is important to note that not all sector-specific indices are tradable in the same manner as broad indices like the Nifty 50. Some sectoral indices are meant primarily for analysis and benchmarking rather than active trading."
                    }
                  ]
                }
              ]
            },
            {
              "id": 3,
              "title": "Common Jargons",
              "description": "It will help you to understand some commonly/most used jargon in stock market. ",
              "image": "stock",
              "slides": [
                {
                  "id": 1,
                  "title": "Jargon",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Jargons\n\nThis chapter is intended to introduce you to some of the most commonly used terms in the stock market along with their meanings and practical context.\n\nBull Market (Bullish) – When you expect stock prices to rise, you are said to be bullish on the stock. From a broader market viewpoint, if the stock market index shows a sustained upward movement over a period of time, the market is described as being in a bull phase.\nExample – The stock market remained bullish from mid-2020 until early 2022.\n\nBear Market (Bearish) – When you anticipate stock prices to fall, you are considered bearish on the stock. At the market level, if the stock market index declines over a prolonged period, it is referred to as a bear market.\nExample – The market experienced a bearish phase from early 2008 to late 2009.\n\nTrend – The term “trend” generally indicates the overall direction in which the market is moving along with its momentum. For instance, if the market is falling sharply, the prevailing trend is described as bearish. If prices are moving within a narrow range without a clear direction, the trend is said to be sideways."
                    }
                  ]
                },
                {
                  "id": 2,
                  "title": "Face Value",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Face value of a stock – The face value (FV), also known as par value, represents the nominal value of a share. Face value is mainly relevant from a corporate actions point of view. Corporate actions will be discussed in a separate chapter.\n\nGenerally, when companies announce dividends, stock splits, or bonus issues, these actions are structured with reference to the face value of the share.\n\nFor example, the face value of Infosys is ₹5. If the company declares an annual dividend of ₹63 per share, this translates to a dividend of 1260%, calculated as 63 divided by 5.\n\nIn short, face value does not indicate the market price of a stock, but it plays an important role in understanding dividends and other corporate announcements."
                    }
                  ]
                },
                {
                  "id": 3,
                  "title": "52-Week & All-time heigh/Low",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "The 52-week high is the highest price at which a stock has traded during the past 52 weeks, which roughly corresponds to one full calendar year.\nSimilarly, the 52-week low represents the lowest price at which the stock has traded during the same 52-week period.\n\nThe 52-week high and low help in understanding the price range within which a stock has moved over the last year. Many traders believe that when a stock approaches or breaks its 52-week high, it may signal a bullish trend in the near future. In the same way, when a stock touches its 52-week low, some traders interpret it as a sign of a bearish trend going forward.\n\nAll-time high / low\n\nThe all-time high is similar in concept to the 52-week high, except that it refers to the highest price the stock has ever traded at since it was first listed on the exchange.\nLikewise, the all-time low is the lowest price at which the stock has ever traded since its listing.\n\nThese levels give a long-term historical perspective of a stock’s price behavior and are often used by investors and traders to assess long-term strength or weakness."
                    }
                  ]
                },
                {
                  "id": 4,
                  "title": "What is circuit (Upper and Lower) ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "The stock exchange defines a price range within which a stock is allowed to trade on a particular trading day. This range is known as the upper and lower circuit.\n\nThe upper circuit limit is the maximum price a stock can reach during the day, while the lower circuit limit is the minimum price it can fall to. These limits are generally set at 2%, 5%, 10%, or 20%, depending on the stock and the exchange’s predefined criteria.\n\nCircuit limits are imposed to prevent excessive price fluctuations, especially when a stock reacts sharply to company-specific news or events. By restricting extreme price movements, the exchange aims to maintain orderly trading and protect market participants from sudden volatility.\n\nThe rules and limits related to circuits can differ for derivative stocks and indices, and these variations will be discussed in detail at a later stage."
                    }
                  ]
                },
                {
                  "id": 5,
                  "title": "Long position",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "A long position, or going long, refers to the direction of a trade where you expect the price of an asset to rise.\n\nFor example, if you have already bought, or plan to buy, shares of Biocon, you are said to be long on Biocon. Similarly, if you buy the Nifty index with the expectation that it will move higher, you are holding a long position on Nifty.\n\nIn simple terms, taking a long position means you are anticipating an upward movement in the price. When a trader or investor holds a long position in a stock or an index, they are considered bullish on that asset."
                    }
                  ]
                },
                {
                  "id": 6,
                  "title": "The short position",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "A short position, or going short, refers to a type of transaction where an asset is sold first with the intention of buying it back later at a lower price. This concept can feel a bit counter-intuitive at first, so let’s understand it with a simple real-life example.\n\nAround mid-2014, Xiaomi entered the Indian market through an exclusive partnership with Flipkart to sell its flagship smartphone, the Mi3. The expected price of the phone was around ₹14,000. To purchase the Mi3, users had to be registered on Flipkart, and the registration window was open only for a limited time.\n\nI registered promptly, but my colleague Rajesh did not. Even though he wanted the phone, he couldn’t buy it due to missing the registration deadline.\n\nOut of desperation, Rajesh approached me with an offer. He said he would buy the phone from me for ₹16,500 and asked me to sell it to him immediately. I agreed, even though I didn’t yet own the phone, and Rajesh paid me the money upfront.\n\nAt that point, I had effectively sold a phone that I did not own. However, I knew I could still purchase it later from Flipkart and deliver it to Rajesh. The risk in this situation was simple—if the phone’s actual price turned out to be higher than ₹16,500, I would incur a loss. For instance, if the price had been ₹18,000, the loss would have been ₹1,500 (18,000 − 16,500).\n\nAs it turned out, the phone was priced at ₹14,000 as expected. I bought it from Flipkart, delivered it to Rajesh, and made a profit of ₹2,500 (16,500 − 14,000).\n\nIf you look closely at the sequence of events, I sold the product first and bought it later. This “sell first, buy later” approach is exactly what defines a short trade."
                    }
                  ]
                },
                {
                  "id": 7,
                  "title": "Very short position",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "The idea of short selling often feels counter-intuitive because, in everyday life, we are not used to selling something we do not own—unless we think like a trader.\n\nLet us return to the stock market with a simple example.\n\nOn day 1, you buy Wipro shares at ₹405. Two days later (day 3), the stock price rises to ₹425, and you sell your shares. In this case, you make a profit of ₹20 per share.\n\nHere,\n\nFirst leg of the trade: Buy Wipro at ₹405\n\nSecond leg of the trade: Sell Wipro at ₹425\n\nYour view was bullish, and the profit came from a rise in price.\n\nNow consider a different situation.\n\nOn day 4, Wipro is trading at ₹425, but you are bearish and believe the stock will fall back to ₹405. Can you still make a profit? Yes—by short selling.\n\nYou sell Wipro at ₹425, and after two days, when the stock falls to ₹405, you buy it back.\n\nIn this case:\n\nFirst leg of the trade: Sell at ₹425\n\nSecond leg of the trade: Buy back at ₹405\n\nThis is how short selling works—you sell first at a higher price and buy later at a lower price.\n\nEffectively, this is the same trade as buying at ₹405 and selling at ₹425, but executed in reverse order.\n\nA common question arises here:\nHow can you sell Wipro shares without owning them?\n\nJust like the earlier example where a phone was sold before owning it, the stock market allows short selling under certain rules.\n\nAn important point to remember is that when you short a stock in the cash segment, you must buy it back on the same day before the market closes. This means short selling in the cash market is strictly an intraday activity.\n\nIn the derivatives segment, however, short positions can be carried forward for multiple days. For now, ignore derivatives and focus on the fact that all cash market short positions must be squared off before market close.\n\nKey Takeaways\n\nWhen you short a stock, you have a bearish view.\n\nYou profit if the stock price falls.\n\nYou incur a loss if the stock price rises.\n\nIn the cash market, short selling requires you to buy back the stock on the same day, unless you are using derivatives.\n\nShorting a stock is simple in execution—you select the stock and place a sell order—but it requires clear understanding and discipline."
                    }
                  ]
                },
                {
                  "id": 8,
                  "title": "Square-off and Intraday",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Square off is a term used to indicate that you are closing an existing trading position.\n\nIf you hold a long position in a stock, squaring off means selling the stock. When you sell to close a long position, it is not considered short selling—you are simply exiting an already open long trade.\n\nIn the same way, if you are short on a stock, squaring off means buying the stock back. When you repurchase the stock, you are only closing your short position; this action does not mean you are taking a long position.\n\nIn simple terms, squaring off always refers to closing an existing position, regardless of whether the position is long or short.\n\nSummary:\n\nWhen you are long, square off by selling the stock\n\nWhen you are short, square off by buying the stock\n\nIntraday Position\n\nAn intraday position is a trade that is opened with the intention of being squared off on the same trading day.\n\nSuch positions cannot be carried forward to the next day. For example, all short positions in stocks (cash segment) are intraday positions and must be closed before the market closes.\n\nIntraday trading focuses on short-term price movements within a single trading session, and positions are automatically squared off by the broker if they are not closed manually."
                    }
                  ]
                },
                {
                  "id": 9,
                  "title": "What is OHLC",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "OHLC in stock prices stands for Open, High, Low, and Close. These four values describe the complete price movement of a stock for a single trading day.\n\nOpen is the price at which the stock begins trading for the day.\n\nHigh is the highest price the stock reaches during the trading session.\n\nLow is the lowest price at which the stock trades during the day.\n\nClose is the final trading price of the stock when the market closes.\n\nThese values are widely used in price charts and technical analysis to understand intraday price behavior. The detailed interpretation of OHLC will be covered later in the technical analysis module.\n\nExample:\nIf the OHLC values of ACC on 17th June were 1486, 1511, 1467, and 1499, then:\n\nOpen = 1486\n\nHigh = 1511\n\nLow = 1467\n\nClose = 1499"
                    }
                  ]
                },
                {
                  "id": 10,
                  "title": "Understand Volume",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "Volume refers to the total number of shares traded in a stock during a specific trading day. It includes both buy and sell transactions combined.\n\nVolume plays an important role in understanding market activity and price movement. A higher volume generally indicates greater participation and interest in a stock, while lower volume suggests reduced trading activity. The relationship between volume and price will be discussed in more detail in the technical analysis module.\n\nExample:\nOn 17th June, if the trading volume of ACC was 5,33,819 shares, it means that a total of 5,33,819 shares of ACC were bought and sold during that trading session."
                    }
                  ]
                },
                {
                  "id": 11,
                  "title": "Market Segment",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": "A market segment refers to a specific division of the stock exchange where a particular category of financial instruments is traded. Each type of instrument differs in terms of risk, return, and trading characteristics. Broadly, the exchange functions through multiple market segments.\n\n1. Capital Market (CM)\n\nThe capital market segment deals with tradable securities such as equity shares and exchange-traded funds (ETFs). Whenever you buy or sell shares of a company, the transaction takes place in the capital market segment.\nShort selling of stocks is also permitted in this segment. The capital market is often referred to as the cash market or spot market.\n\n2. Futures and Options (FO)\n\nThe Futures and Options segment, commonly known as the equity derivatives segment, is where leveraged instruments are traded. This segment allows traders to take positions using futures and options contracts.\nThe derivatives market will be covered in detail in the Futures and Options module.\n\n3. Currency Derivatives Segment (CDS)\n\nThe currency derivatives segment facilitates trading in currency pairs such as USD/INR, EUR/INR, and JPY/INR. Trading in this segment is conducted through futures and options contracts, which is why it is classified as a currency derivative market.\n\n4. Wholesale Debt Market (WDM)\n\nThe wholesale debt market focuses on fixed-income securities, including government bonds, treasury bills, and corporate debt instruments. This segment is primarily used by institutional participants rather than retail traders."
                    }
                  ]
                }
              ]
            }
          ]
        },

        {
          "id": 3,
          "name": "UNSTOPPABLE",
          "image": "unstoppable",
          "topCard": {
            "title": "UNSTOPPABLE",
            "description": "Advanced strategies, mindset, and professional-level insights."
          },
          "chapters": [
            {
              "id": 1,
              "title": "The way to IPO",
              "description": "Read this to understand why companies file for IPO and and how there shares lists in primary market to trade exchange. ",
              "image": "stock",
              "slides": [
                {
                  "id": 1,
                  "title": "How a business founded ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 2,
                  "title": "Angel investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 3,
                  "title": "venture capitalists",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 4,
                  "title": "Bankers and other investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 5,
                  "title": "Private Equity Investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 6,
                  "title": "The Initial public Offering",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 7,
                  "title": "Why companies need to list on Market",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 8,
                  "title": "The merchant bankers",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 9,
                  "title": "The way to IPO event",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 10,
                  "title": "What things happens after listing on Market ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 11,
                  "title": "Some most important jargon",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 12,
                  "title": "How to take subscription of an IPO",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                }
              ]
            },
            {
              "id": 2,
              "title": "The way to IPO",
              "description": "Read this to understand why companies file for IPO and and how there shares lists in primary market to trade exchange. ",
              "image": "stock",
              "slides": [
                {
                  "id": 1,
                  "title": "How a business founded ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 2,
                  "title": "Angel investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 3,
                  "title": "venture capitalists",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 4,
                  "title": "Bankers and other investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 5,
                  "title": "Private Equity Investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 6,
                  "title": "The Initial public Offering",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 7,
                  "title": "Why companies need to list on Market",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 8,
                  "title": "The merchant bankers",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 9,
                  "title": "The way to IPO event",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 10,
                  "title": "What things happens after listing on Market ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 11,
                  "title": "Some most important jargon",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 12,
                  "title": "How to take subscription of an IPO",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                }
              ]
            },
            {
              "id": 3,
              "title": "The way to IPO",
              "description": "Read this to understand why companies file for IPO and and how there shares lists in primary market to trade exchange. ",
              "image": "stock",
              "slides": [
                {
                  "id": 1,
                  "title": "How a business founded ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 2,
                  "title": "Angel investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 3,
                  "title": "venture capitalists",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 4,
                  "title": "Bankers and other investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 5,
                  "title": "Private Equity Investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 6,
                  "title": "The Initial public Offering",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 7,
                  "title": "Why companies need to list on Market",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 8,
                  "title": "The merchant bankers",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 9,
                  "title": "The way to IPO event",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 10,
                  "title": "What things happens after listing on Market ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 11,
                  "title": "Some most important jargon",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 12,
                  "title": "How to take subscription of an IPO",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                }
              ]
            },
            {
              "id": 4,
              "title": "The way to IPO",
              "description": "Read this to understand why companies file for IPO and and how there shares lists in primary market to trade exchange. ",
              "image": "stock",
              "slides": [
                {
                  "id": 1,
                  "title": "How a business founded ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 2,
                  "title": "Angel investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 3,
                  "title": "venture capitalists",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 4,
                  "title": "Bankers and other investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 5,
                  "title": "Private Equity Investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 6,
                  "title": "The Initial public Offering",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 7,
                  "title": "Why companies need to list on Market",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 8,
                  "title": "The merchant bankers",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 9,
                  "title": "The way to IPO event",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 10,
                  "title": "What things happens after listing on Market ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 11,
                  "title": "Some most important jargon",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 12,
                  "title": "How to take subscription of an IPO",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                }
              ]
            },
            {
              "id": 5,
              "title": "The way to IPO",
              "description": "Read this to understand why companies file for IPO and and how there shares lists in primary market to trade exchange. ",
              "image": "stock",
              "slides": [
                {
                  "id": 1,
                  "title": "How a business founded ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 2,
                  "title": "Angel investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 3,
                  "title": "venture capitalists",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 4,
                  "title": "Bankers and other investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 5,
                  "title": "Private Equity Investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 6,
                  "title": "The Initial public Offering",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 7,
                  "title": "Why companies need to list on Market",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 8,
                  "title": "The merchant bankers",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 9,
                  "title": "The way to IPO event",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 10,
                  "title": "What things happens after listing on Market ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 11,
                  "title": "Some most important jargon",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 12,
                  "title": "How to take subscription of an IPO",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                }
              ]
            },
            {
              "id": 6,
              "title": "The way to IPO",
              "description": "Read this to understand why companies file for IPO and and how there shares lists in primary market to trade exchange. ",
              "image": "stock",
              "slides": [
                {
                  "id": 1,
                  "title": "How a business founded ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 2,
                  "title": "Angel investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 3,
                  "title": "venture capitalists",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 4,
                  "title": "Bankers and other investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 5,
                  "title": "Private Equity Investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 6,
                  "title": "The Initial public Offering",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 7,
                  "title": "Why companies need to list on Market",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 8,
                  "title": "The merchant bankers",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 9,
                  "title": "The way to IPO event",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 10,
                  "title": "What things happens after listing on Market ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 11,
                  "title": "Some most important jargon",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 12,
                  "title": "How to take subscription of an IPO",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },

    {
      "id": 2,
      "title": "Fundamentals",
      "image": "fundamental",
      "topCard": {
        "title": "Fundamentals",
        "description": "Understand financial statements, ratios, and valuation methods."
      },
      "levels": [
        {
          "id": 1,
          "name": "HUSTLER",
          "image": "hustler",
          "topCard": {
            "title": "HUSTLER",
            "description": "Learn the basics of financial statements and accounting."
          },
          "chapters": [
            {
              "id": 1,
              "title": "The way to IPO",
              "description": "Read this to understand why companies file for IPO and and how there shares lists in primary market to trade exchange. ",
              "image": "stock",
              "slides": [
                {
                  "id": 1,
                  "title": "How a business founded ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 2,
                  "title": "Angel investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 3,
                  "title": "venture capitalists",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 4,
                  "title": "Bankers and other investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 5,
                  "title": "Private Equity Investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 6,
                  "title": "The Initial public Offering",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 7,
                  "title": "Why companies need to list on Market",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 8,
                  "title": "The merchant bankers",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 9,
                  "title": "The way to IPO event",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 10,
                  "title": "What things happens after listing on Market ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 11,
                  "title": "Some most important jargon",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 12,
                  "title": "How to take subscription of an IPO",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                }
              ]
            },
            {
              "id": 2,
              "title": "The way to IPO",
              "description": "Read this to understand why companies file for IPO and and how there shares lists in primary market to trade exchange. ",
              "image": "stock",
              "slides": [
                {
                  "id": 1,
                  "title": "How a business founded ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 2,
                  "title": "Angel investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 3,
                  "title": "venture capitalists",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 4,
                  "title": "Bankers and other investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 5,
                  "title": "Private Equity Investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 6,
                  "title": "The Initial public Offering",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 7,
                  "title": "Why companies need to list on Market",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 8,
                  "title": "The merchant bankers",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 9,
                  "title": "The way to IPO event",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 10,
                  "title": "What things happens after listing on Market ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 11,
                  "title": "Some most important jargon",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 12,
                  "title": "How to take subscription of an IPO",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                }
              ]
            },
            {
              "id": 3,
              "title": "The way to IPO",
              "description": "Read this to understand why companies file for IPO and and how there shares lists in primary market to trade exchange. ",
              "image": "stock",
              "slides": [
                {
                  "id": 1,
                  "title": "How a business founded ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 2,
                  "title": "Angel investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 3,
                  "title": "venture capitalists",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 4,
                  "title": "Bankers and other investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 5,
                  "title": "Private Equity Investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 6,
                  "title": "The Initial public Offering",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 7,
                  "title": "Why companies need to list on Market",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 8,
                  "title": "The merchant bankers",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 9,
                  "title": "The way to IPO event",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 10,
                  "title": "What things happens after listing on Market ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 11,
                  "title": "Some most important jargon",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 12,
                  "title": "How to take subscription of an IPO",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                }
              ]
            }
          ]
        },

        {
          "id": 2,
          "name": "MASTERMIND",
          "image": "mastermind",
          "topCard": {
            "title": "MASTERMIND",
            "description": "Dive deeper into analysis, valuation, and company fundamentals."
          },
          "chapters": [
            {
              "id": 1,
              "title": "The way to IPO",
              "description": "Read this to understand why companies file for IPO and and how there shares lists in primary market to trade exchange. ",
              "image": "stock",
              "slides": [
                {
                  "id": 1,
                  "title": "How a business founded ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 2,
                  "title": "Angel investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 3,
                  "title": "venture capitalists",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 4,
                  "title": "Bankers and other investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 5,
                  "title": "Private Equity Investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 6,
                  "title": "The Initial public Offering",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 7,
                  "title": "Why companies need to list on Market",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 8,
                  "title": "The merchant bankers",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 9,
                  "title": "The way to IPO event",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 10,
                  "title": "What things happens after listing on Market ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 11,
                  "title": "Some most important jargon",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 12,
                  "title": "How to take subscription of an IPO",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                }
              ]
            },
            {
              "id": 2,
              "title": "The way to IPO",
              "description": "Read this to understand why companies file for IPO and and how there shares lists in primary market to trade exchange. ",
              "image": "stock",
              "slides": [
                {
                  "id": 1,
                  "title": "How a business founded ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 2,
                  "title": "Angel investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 3,
                  "title": "venture capitalists",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 4,
                  "title": "Bankers and other investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 5,
                  "title": "Private Equity Investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 6,
                  "title": "The Initial public Offering",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 7,
                  "title": "Why companies need to list on Market",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 8,
                  "title": "The merchant bankers",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 9,
                  "title": "The way to IPO event",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 10,
                  "title": "What things happens after listing on Market ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 11,
                  "title": "Some most important jargon",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 12,
                  "title": "How to take subscription of an IPO",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                }
              ]
            },
            {
              "id": 3,
              "title": "The way to IPO",
              "description": "Read this to understand why companies file for IPO and and how there shares lists in primary market to trade exchange. ",
              "image": "stock",
              "slides": [
                {
                  "id": 1,
                  "title": "How a business founded ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 2,
                  "title": "Angel investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 3,
                  "title": "venture capitalists",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 4,
                  "title": "Bankers and other investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 5,
                  "title": "Private Equity Investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 6,
                  "title": "The Initial public Offering",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 7,
                  "title": "Why companies need to list on Market",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 8,
                  "title": "The merchant bankers",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 9,
                  "title": "The way to IPO event",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 10,
                  "title": "What things happens after listing on Market ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 11,
                  "title": "Some most important jargon",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 12,
                  "title": "How to take subscription of an IPO",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                }
              ]
            }
          ]
        },

        {
          "id": 3,
          "name": "UNSTOPPABLE",
          "image": "unstoppable",
          "topCard": {
            "title": "UNSTOPPABLE",
            "description": "Advanced strategies, mindset, and professional-level insights."
          },
          "chapters": [
            {
              "id": 1,
              "title": "The way to IPO",
              "description": "Read this to understand why companies file for IPO and and how there shares lists in primary market to trade exchange. ",
              "image": "stock",
              "slides": [
                {
                  "id": 1,
                  "title": "How a business founded ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 2,
                  "title": "Angel investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 3,
                  "title": "venture capitalists",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 4,
                  "title": "Bankers and other investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 5,
                  "title": "Private Equity Investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 6,
                  "title": "The Initial public Offering",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 7,
                  "title": "Why companies need to list on Market",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 8,
                  "title": "The merchant bankers",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 9,
                  "title": "The way to IPO event",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 10,
                  "title": "What things happens after listing on Market ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 11,
                  "title": "Some most important jargon",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 12,
                  "title": "How to take subscription of an IPO",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                }
              ]
            },
            {
              "id": 2,
              "title": "The way to IPO",
              "description": "Read this to understand why companies file for IPO and and how there shares lists in primary market to trade exchange. ",
              "image": "stock",
              "slides": [
                {
                  "id": 1,
                  "title": "How a business founded ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 2,
                  "title": "Angel investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 3,
                  "title": "venture capitalists",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 4,
                  "title": "Bankers and other investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 5,
                  "title": "Private Equity Investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 6,
                  "title": "The Initial public Offering",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 7,
                  "title": "Why companies need to list on Market",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 8,
                  "title": "The merchant bankers",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 9,
                  "title": "The way to IPO event",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 10,
                  "title": "What things happens after listing on Market ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 11,
                  "title": "Some most important jargon",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 12,
                  "title": "How to take subscription of an IPO",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                }
              ]
            },
            {
              "id": 3,
              "title": "The way to IPO",
              "description": "Read this to understand why companies file for IPO and and how there shares lists in primary market to trade exchange. ",
              "image": "stock",
              "slides": [
                {
                  "id": 1,
                  "title": "How a business founded ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 2,
                  "title": "Angel investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 3,
                  "title": "venture capitalists",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 4,
                  "title": "Bankers and other investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 5,
                  "title": "Private Equity Investors",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 6,
                  "title": "The Initial public Offering",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 7,
                  "title": "Why companies need to list on Market",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 8,
                  "title": "The merchant bankers",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 9,
                  "title": "The way to IPO event",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 10,
                  "title": "What things happens after listing on Market ?",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 11,
                  "title": "Some most important jargon",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                },
                {
                  "id": 12,
                  "title": "How to take subscription of an IPO",
                  "blocks": [
                    {
                      "type": "TEXT",
                      "text": ""
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}
